[
    {
        "content": "<p>Hi everyone,  <br>\nI'm experimenting with a Wasmtime embedding that virtualizes selected WASI Preview 2 interfaces (<code>clocks</code>, <code>random</code>, selected <code>filesystem</code> ops).</p>\n<p>Runtime sequence in the prototype:</p>\n<ol>\n<li>Guest code runs and requests effectful WASI operations.</li>\n<li>The embedding intercepts those imports via shims (no ambient host access).</li>\n<li>Each shim appends a canonical effect-intent record.</li>\n<li>The call returns a resolved value from an injected provider (replay log / fixture / simulated world).</li>\n<li>After the run, a separate promotion step can materialize selected intents under policy, producing real host effects (e.g. FS writes/network) or skipping them.</li>\n</ol>\n<p>So execution-time resolution and real-world materialization are intentionally split.  <br>\nReplay mode resolves effects strictly from the recorded log.  <br>\nThis is an embedding strategy only; it does not propose changes to WASI or the Component Model.</p>\n<p>I'm curious:<br>\nIs there existing ecosystem work overlapping with this log-and-defer approach?<br>\nAre there Wasmtime constraints (resource tables, async model, canonical ABI lowering/lifting) that make this problematic, especially for filesystem handles?<br>\nWould a minimal artifact (embedding + replay demo) be useful for discussion here or is there a better forum?</p>",
        "id": 574932006,
        "sender_full_name": "Bogdan",
        "timestamp": 1771591481
    },
    {
        "content": "<p>i don't know about defer but this seems similar to durable computation systems where one records effects in a log tape to allow replay. Look at <a href=\"https://obeli.sk/\">https://obeli.sk/</a> for an example and I'm currently using a rough port of <a href=\"http://restate.dev\">restate.dev</a> 's design in a project over wasm.</p>",
        "id": 575149891,
        "sender_full_name": "dman-os",
        "timestamp": 1771752661
    }
]