[
    {
        "content": "<p>I need to use the <a href=\"https://github.com/bytecodealliance/wizer/pull/140\">new Wizer</a> that internally uses the newer wasmtime based Wizer.<br>\nI need the NPM version, so can't just rely on <code>wasmtime wizer</code></p>\n<p>Is there anything blocking the latest version from being published?</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wizer/pull/140\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/7cf36e7f00466a324edab5970b50a14d1748aadc/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f386264393838633836623632646133643466616339643831633134353237623264336536303839653630346434643334396438333538366237323164333962392f62797465636f6465616c6c69616e63652f77697a65722f70756c6c2f313430&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wizer/pull/140\" title=\"Switch the source-of-truth to Wasmtime by alexcrichton 路 Pull Request #140 路 bytecodealliance/wizer\">Switch the source-of-truth to Wasmtime by alexcrichton 路 Pull Request #140 路 bytecodealliance/wizer</a></div><div class=\"message_embed_description\">This commit is a follow-up to the merging of the Wizer repository into Wasmtime. At this time I don&#39;t have plans for what to do about the npm package or the old wizer CLI, so I&#39;ve updated t...</div></div></div>",
        "id": 566423378,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1767640950
    },
    {
        "content": "<blockquote>\n<p>I figure that if other folks are interested to maintain this then this is a reasonable-enough starting point and can take it from here.</p>\n</blockquote>\n<p>I read this as \"there is no maintainer currently\", I also wanted to ask how to proceed with wizer since I'm using exnref in my code so the released one is not recent enough for me either (exnref does work though, it'd just be a new parameter like bulk-memory support, I have a patch)</p>",
        "id": 566426984,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1767642386
    },
    {
        "content": "<p>That would be pretty bad, as ComponentizeJS relies on the NPM package</p>",
        "id": 566427255,
        "sender_full_name": "Mendy Berger",
        "timestamp": 1767642474
    },
    {
        "content": "<p>an interesting experiment I am working on is actually combining wasmtime-wizer with js WebAssembly.Instance, Alex recently refactored wizer so that any wasm runtime can be used and the special code can be compiled to wasm itself, so I have compiled wizer with wasm-bindgen, I just found another bug I need to fix but will upload to github later today or tomorrow</p>\n<p>once this fully works, componentizejs could get a wizer version that is a 1MB wasm blob which otherwise uses js wasm during preinitialization, but then we really need to talk about who maintains what where ;)</p>",
        "id": 566428110,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1767642839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> hey would you mind sharing how to do a release here for Wizer? We'd like to get the latest code out into NPM -- is it as easy as kicking off a GH action? (assuming of course one had the right creds!)</p>",
        "id": 569294163,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1769011644
    },
    {
        "content": "<p>I don't really know how the npm publishing worked. Jake Champion and Guy Bedford were the ones who maintained the npm package and its CI publishing. They have both since stopped participating in the BA and we haven't had anyone step up to port that infrastructure to Wizer's new home inside the Wasmtime repo. I also am not really sure about the npm account credentials.</p>\n<p>I think what is needed is someone to investigate what the old npm publishing scripts in CI did, port them to Wasmtime, and in the process figure out exactly what credentials and such are needed. And step up and take responsibility for maintaining this infrastructure over time.</p>",
        "id": 569328060,
        "sender_full_name": "fitzgen (he/him)",
        "timestamp": 1769020583
    },
    {
        "content": "<p>It looks like the npm package (<a href=\"https://www.npmjs.com/package/@bytecodealliance/wizer\">https://www.npmjs.com/package/@bytecodealliance/wizer</a>) is owned by Till, Victor and myself in addition to Guy. I'm happy to push a button to grant credentials whenever needed or transfer this to proper team ownership, though I also have zero remaining idea about how it worked and second the request for a new person to understand and own it</p>",
        "id": 569329853,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1769021111
    },
    {
        "content": "<p>Ah thanks for clarifying this for me y'all  <span aria-label=\"bow\" class=\"emoji emoji-1f647\" role=\"img\" title=\"bow\">:bow:</span> </p>\n<p>With regards to your note <span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> </p>\n<blockquote>\n<p>we haven't had anyone step up to port that infrastructure to Wizer's new home inside the Wasmtime repo. I also am not really sure about the npm account credentials.</p>\n</blockquote>\n<p>I can absolutely step up to get the publishing scripts in order and do this -- did not realize this was a gap at present. P3 Jco is my current focus but there's a lot of sort of backed up CI contributions that I have lower on my priority list so this probably fits in there somewhere.</p>\n<p>With regards to what you noted <span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> </p>\n<blockquote>\n<p>I'm happy to push a button to grant credentials whenever needed or transfer this to proper team ownership, though I also have zero remaining idea about how it worked and second the request for a new person to understand and own it</p>\n</blockquote>\n<p>On the team ownership point <span class=\"user-mention\" data-user-id=\"421591\">@Bailey Hayes</span> is probably a good CC here -- On the NPM side we should definitely have a bot account w/ credentials stored by the BA that is on all of the projects.</p>\n<p>If you're suggesting that it really should be a completely new person to the process happy to go with that, but without any strong objections I'll try to work on this.</p>",
        "id": 569438593,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1769072907
    },
    {
        "content": "<p>Yes, we have a bot user you can use. This user is  also already configured for open vsx.</p>\n<p>If the configured pat for this job is already valid and we can get something published now, let's do that first. Then come up with the best path for maintainable CI (should it just be a hook on wasmtime release? part of jco's release schedule? etc etc).</p>",
        "id": 569509012,
        "sender_full_name": "Bailey Hayes",
        "timestamp": 1769093322
    },
    {
        "content": "<p>Yeah I'm not sure what PAT is on the repo right now actually -- I'm not a maintainer on Wizer, so I can't do that release.</p>\n<p>Since Wizer has essentially moved to wasmtime it looks like we should be moving the release process to be a part of wasmtime, and moving the Wizer code that is outside there into wasmtime...</p>",
        "id": 569514161,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1769094378
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253990\">@fitzgen (he/him)</span> / <span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> how do you want to proceed? It seems like we have two options:</p>\n<ol>\n<li>Get a release out w/ <code>@bytecodealliance/wizer</code> as is, then do (2)</li>\n<li>Move <code>@bytecodealliance/wizer</code>'s content into <code>@bytecodealliance/wasmtime</code> along with relevant, then do a release</li>\n</ol>\n<p>I'd like to do (1) <em>then</em> (2), but happy to go straight to (2) if anyone feels strongly about it. </p>\n<p>Regardless, I'd need access to the Wizer repo as a maintainer to make that happen (I'm not a maintainer on the GH side).</p>",
        "id": 569515593,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1769094648
    },
    {
        "content": "<p>not to derail but I did upload <a href=\"https://github.com/Gentle/wizerjs\">https://github.com/Gentle/wizerjs</a> now, but I don't think I have the time to maintain it alone, Victor are you interested? This is that wizer compiled to wasm code I mentioned</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/Gentle/wizerjs\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/133bcae29c4fbcdc85a717df0afb13a0326f41bc/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f316233373961643235646335373864333566333838616430616365666666633134623562663836373235666538313733393865323930643263626664366437372f47656e746c652f77697a65726a73&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/Gentle/wizerjs\" title=\"GitHub - Gentle/wizerjs: wizer without wasmtime, using wasm-bindgen\">GitHub - Gentle/wizerjs: wizer without wasmtime, using wasm-bindgen</a></div><div class=\"message_embed_description\">wizer without wasmtime, using wasm-bindgen. Contribute to Gentle/wizerjs development by creating an account on GitHub.</div></div></div>",
        "id": 569516827,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1769094907
    },
    {
        "content": "<blockquote>\n<p>If you're suggesting that it really should be a completely new person to the process happy to go with that, but without any strong objections I'll try to work on this.</p>\n</blockquote>\n<p>no I'm happy to see you take this over <span class=\"user-mention\" data-user-id=\"598440\">@Victor Adossi</span>  -- thanks! By \"new person\" I just meant \"not me or the other listed current owners\" :-)</p>",
        "id": 569555311,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1769104462
    },
    {
        "content": "<p>Hahah OK! yeah I was wondering just a bit where a new person to get fully ramped up on this was going to come from! We've definitely got some contributors but the venn diagram of people who understand all the bits required is probably pretty unfortunately small at this point. </p>\n<p>Alright well biasing for action here, if no one has any strong objections I'm going to go with the 1-2 here! </p>\n<p>Release a version with the current repo (making any changes necessary), then get a PR in to wasmtime that moves the publishing mechanisms and any other necessary code over so that wasmtime can automatically ( <span aria-label=\"fingers crossed\" class=\"emoji emoji-1f91e\" role=\"img\" title=\"fingers crossed\">:fingers_crossed:</span> ) trigger releases as they move.</p>",
        "id": 569558527,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1769105373
    }
]