[
    {
        "content": "<p>Hello everyone,</p>\n<p>I've been looking again as some Bytecode Alliance projects and noticed some differences in release approaches that I'm curious about:</p>\n<ol>\n<li>\n<p>Is there documentation on the decision-making process between using Git tags versus GitHub releases for versioning?</p>\n</li>\n<li>\n<p>For Wasmtime, I notice GitHub releases include changelogs, but I don't see a CHANGELOG.md file in the repository. How is this changelog maintained?</p>\n</li>\n<li>\n<p>Cargo-component appears to have shifted from GitHub releases (up to 0.20.0 in January) to Git tags (currently at 0.21.1). Is there a changelog available for cargo-component?</p>\n</li>\n</ol>\n<p>Generally, I'm wondering if the Alliance or a major project within it has established best practices for version releases and changelog maintenance. If such practices exist, are projects at different stages of adopting them, or is this an area where approaches intentionally vary by project?</p>\n<p>Even as I ask, this sounds like busy work that your teams don't have time for, on the other hand, some are working on changelogs and others used to and it seems preview 2 has been out long enough that outside projects are expected to be able to use the pieces but it is hard to follow what is changing, even for versions being published to <a href=\"http://docs.rs\">docs.rs</a>.</p>\n<p>Thank you for any insights you can share!</p>",
        "id": 508926895,
        "sender_full_name": "Frank Rehwinkel",
        "timestamp": 1743258337
    },
    {
        "content": "<p>Wasmtime has <a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/RELEASES.md\">https://github.com/bytecodealliance/wasmtime/blob/main/RELEASES.md</a></p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/blob/main/RELEASES.md\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/cb3627eddcee2363820cd063b2322ba854ad85b1/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f393066316663303939343165323466323939646235633432316633633133656239633864336536376362343339643166643666636363326362396636303439652f62797465636f6465616c6c69616e63652f7761736d74696d65&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/RELEASES.md\" title=\"wasmtime/RELEASES.md at main · bytecodealliance/wasmtime\">wasmtime/RELEASES.md at main · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">A lightweight WebAssembly runtime that is fast, secure, and standards-compliant - bytecodealliance/wasmtime</div></div></div>",
        "id": 508927195,
        "sender_full_name": "Dave Bakker (badeend)",
        "timestamp": 1743258597
    },
    {
        "content": "<p>Each repository in the BA makes its own conventions right now, there's not an over-arching set of conventions everything follows. As Dave pointed out Wasmtime does have a changelog, it's just named a bit differently.</p>",
        "id": 508941076,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1743268260
    }
]