[
    {
        "content": "<p>I have had good luck using Wizer to snapshot memory state into new Wasm code. Is there an upper limit to how much memory can be snapshotted? We would eventually want to use mem64 to work with Wasm that deals with &gt;4GiB memory. Will Wizer work with mem64?</p>",
        "id": 492610941,
        "sender_full_name": "Friday More",
        "timestamp": 1736385071
    },
    {
        "content": "<p>Wizer will be limited by the size of memory itself, so for 32-bit memories it's not possible to have a larger-than-4G image. That only starts to be possible with 64-bit memories, which I'm not sure if wizer supports yet</p>",
        "id": 492630108,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1736397404
    },
    {
        "content": "<p>Thanks Alex - yeah, that's what I am wondering as well: does Wizer support the mem64 proposal</p>",
        "id": 492649802,
        "sender_full_name": "Friday More",
        "timestamp": 1736407082
    },
    {
        "content": "<p>Quick follow up on this thread:</p>\n<ol>\n<li>Anyone familiar with Wizer know if Wizer will support mem64?</li>\n<li>Is there a limit to how large Wasm code can be for Wasmtime to work with. E.g., can Wasmtime handle a 5 GB file?<br>\nThank you</li>\n</ol>",
        "id": 497788058,
        "sender_full_name": "Friday More",
        "timestamp": 1738717825
    },
    {
        "content": "<p>AFAIK no one's signed up to do memory64 yet, but I suspect that folks would be around to review such work if you're interested in making a pull request. I don't think it'd be too much work.</p>\n<p>As for wasm limits, there's not really file size limits as much as there are wasm item limits (e.g. functions, globals, etc). I'd recommend feeding your 5G file into wasmtime and seeing what happens. I'm not aware of anyone else running files so large so you might run into bugs, but please feel free to file issues about them.</p>",
        "id": 497813820,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1738734781
    },
    {
        "content": "<p>Thanks Alex</p>",
        "id": 497952106,
        "sender_full_name": "Friday More",
        "timestamp": 1738778272
    }
]