[
    {
        "content": "<p>I've <a href=\"https://github.com/WebAssembly/component-model/issues/555\">opened an issue</a> on the component-model repo about a near-term plan for optional imports which if folks have thoughts on please feel free to drop them there or here!</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/WebAssembly/component-model/issues/555\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/7c4fd28f1325f3c18518213721c75e1ebbbafef4/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f333762626430343834643764393764376431616365396533346639393739376633356663386438646363356132396663363635363133346438303166323930622f576562417373656d626c792f636f6d706f6e656e742d6d6f64656c2f6973737565732f353535&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/WebAssembly/component-model/issues/555\" title=\"Optional Imports Phase 1: Tooling Conventions 路 Issue #555 路 WebAssembly/component-model\">Optional Imports Phase 1: Tooling Conventions 路 Issue #555 路 WebAssembly/component-model</a></div><div class=\"message_embed_description\">Here I'd like to write up the result of some discussion that was had today about optional imports. In the fullness of time optional imports is expected to be a relatively complex feature that's int...</div></div></div>",
        "id": 535179924,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1755626707
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> Maybe related: I've been trying to model a plugin system where plugin authors may request optional host permissions (which won't necessarily all be granted by the user), where permissions end up translating to functionality linked by the host, but which shouldn't fail to instantiate if some capabilities are missing (and it's left to the guest to check at runtime whether necessary capabilities are available), ideally without requiring plugin authors to write any .wit themselves </p>\n<p>Would I be correct in thinking that future phases of optional imports may help facilitate something like this? Am I making things unnecessarily complicated for myself, and I should just write some sort of capability discovery WIT interface, which returns optional resources? Not assuming I have a particularly novel use-case, so wondering what others have done here and what might be recommended.</p>",
        "id": 541303444,
        "sender_full_name": "Theodore Brockman",
        "timestamp": 1758738837
    },
    {
        "content": "<p>You're thinking is about the same as mine, optional imports are probably the most natural implementation of this but in the meantime optional resource getters is probably the way to model this</p>",
        "id": 541469965,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1758809739
    },
    {
        "content": "<p>Well that's definitely encouraging to hear that I'm at least somewhat close to understanding things haha, thanks for the response.</p>",
        "id": 541914271,
        "sender_full_name": "Theodore Brockman",
        "timestamp": 1759088504
    }
]