[
    {
        "content": "<p>imsnif opened <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Hi wasmtime,</p>\n<p>It seems to me as if there's a major wasmtime version release every month or so. This is certainly a commendable cadence, but as a dependent of the runtime in a production environment this is a bit more than I can personally keep up with.</p>\n<p>I'm happy to stay with older versions - the only thing I'm worried about is security vulnerabilities. I tried to find some sort of document detailing how these are handled (if at all) in older versions but could not find anything.</p>\n<p>Could you help me out by pointing me in the right direction?</p>\n<p>Thanks!</p>\n</blockquote>",
        "id": 495257097,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737544469
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2607804487\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>We've got documentation for the release process <a href=\"https://docs.wasmtime.dev/stability-release.html\">in the online book</a>, notably:</p>\n<blockquote>\n<ul>\n<li>A new major version of Wasmtime will be made available once a month.</li>\n<li>Security bugs and correctness fixes will be backported to the latest two releases of Wasmtime and issued as patch releases.</li>\n</ul>\n</blockquote>\n<p>You can also read about our current policies around security issues <a href=\"https://docs.wasmtime.dev/security.html\">online as well</a>.</p>\n<p>Outside of the online documentation some background on our current policy is that maintaining older releases for very long periods of time is a significant tax on engineering resources which are already thin for Wasmtime, so that's the primary reason we don't support, for example, year-old releases of Wasmtime. If it's reasonable for your use case we'd love assistance/contributions of engineering resources to the project to help perhaps shift the needle on this over time to maintain more releases and/or set a different cadence.</p>\n</blockquote>",
        "id": 495331978,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737565798
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2608018281\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>The reason Zellij is using older Wasmtime versions is because it bumps the MSRV much less frequently than Wasmtime.</p>\n</blockquote>",
        "id": 495353188,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737571870
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2608223674\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>In case others are interested (I'm sure you've already seen this @bjorn3) our MSRV policy is <a href=\"https://docs.wasmtime.dev/contributing-coding-guidelines.html#minimum-supported-rustc-version-msrv\">here</a> and it's definitely one we're open to change as well. The tradeoff though is pretty similar to the release process where we don't have infinite engineering resources but it's also not set in stone such that it can never change.</p>\n<p>Again at least personally I'm always willing to reconsider these policies and talk about them further. In the past though most discussions have bottomed out in \"well I just want my project's MSRV to be compatible\" or \"I want to have security updates for as long as possible\". What we have now is hoping to strike a balance between maintainer time and usefulness to embedders, and the main sources of feedback we have today are (a) the embeddings that maintainers work on and (b) the frequency/feedback of issues like this.</p>\n</blockquote>",
        "id": 495370040,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737578578
    },
    {
        "content": "<p>imsnif <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2609328183\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Thanks for the answers and the links! I now understand the process much better and know what to expect.</p>\n<p>As for contributing engineering resources: I dare say Zellij has even less engineering resources than wasmtime, seeing as it's mostly just me maintaining it with the occasional outside help <em>hat tip to @bjorn3</em>. I do appreciate the work done by the wasmtime maintainers and wish I could give back, but unfortunately I don't see this ever happening in a reasonable way.</p>\n<p>As for my point of view in aforementioned discussion: we use wasmtime as a runtime for our plugin system. We run untrusted user written plugins that run on user machines and need to be both backwards and forwards compatible for a very long time (the scope is measured in years and I dare hope decades). As an application/infrastructure developer it is of course my wish to have one un-changing version that will never add new features and only provide security critical updates that are relevant for my use-case.</p>\n<p>But I of course realize this is not feasible for a project like wasmtime or a technology as new as wasm/wasi. Development and innovation must happen and one cannot simply stand still and provide support for existing embedders. Especially non-paying ones.</p>\n<p>That being said, I feel that asking embedders to go through a significant breaking upgrade every 3 months lest they lose security updates is a lot to ask. Especially considering that in our case we would also potentially need to try and provide a path for old plugins to still work with newer versions and vice versa.</p>\n<p>Again though, I'm only providing this feedback because you said it is valuable to you. I'm very happy with wasmtime and am sure I'll be able to smooth over any rough edges even if things stay exactly as they are.</p>\n</blockquote>",
        "id": 495460833,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737625156
    },
    {
        "content": "<p>tschneidereit <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2609471968\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>As Alex said, we're definitely open to reconsidering parts of the policy here: both regarding which releases we do security fixes for, and MSRV. Can you say which of these is more important to your use case?</p>\n<p>Independently, we care a lot about not breaking content, so at least in theory you shouldn't have to worry about old plug-ins not working anymore.</p>\n</blockquote>",
        "id": 495472576,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737629037
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2610116631\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Yes thank you again for discussing this here, it's definitely appreciated! Everything you say makes sense to me as well.</p>\n<p>In addition to Till's question, have you experienced breakage updating Wasmtime in the past? Our goal is that each major version of wasmtime has little different than the previous version API-wise. If there are areas of significant churn though that's a good sign that we should sit down and perhaps redesign or design the area again to maximize future-compatibilty.</p>\n</blockquote>",
        "id": 495525819,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737646104
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2610142327\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>So far the only Wasmtime update Zellij has done is from 21.0.1 (the initial version I picked when rewriting Zellij's plugin infra to use Wasmer to Wasmtime) to 21.0.2 (which had a bugfix) If I just bump the Wasmtime version to 29.0 everything at least still compiles. I just saw that <a href=\"https://github.com/zellij-org/zellij/pull/3945\">https://github.com/zellij-org/zellij/pull/3945</a> will bump the MSRV of Zellij. I might open a Zellij PR to update Wasmtime once it merges.</p>\n</blockquote>",
        "id": 495528078,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737646682
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2610338684\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Oh nice! In theory that's the experience we're aiming for at this time. We have the flexibility to change things as necessary but embedders by-and-large don't have to worry about it unless they're using practically the whole surface area of <code>wasmtime</code> (which I suspect Zellij is not).</p>\n<p>This brings up a few points/questions for me:</p>\n<ul>\n<li>If an upgrade of <code>wasmtime</code> is ever difficult in the future, please feel free to file an issue and/or raise something on <a href=\"https://bytecodealliance.zulipchat.com/\">Zulip</a>.</li>\n<li>Does Zellij have an MSRV policy currently? Our choice of \"stable minus two\" is pretty arbitrary and changing that to three or four I don't think would be unreasonable if that would match Zellij.</li>\n</ul>\n</blockquote>",
        "id": 495541278,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737650127
    },
    {
        "content": "<p>imsnif <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2612745931\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<blockquote>\n<p>As Alex said, we're definitely open to reconsidering parts of the policy here: both regarding which releases we do security fixes for, and MSRV. Can you say which of these is more important to your use case?</p>\n</blockquote>\n<p>The former, definitely. In my ideal world we would ever only have to update patch releases for security reasons.</p>\n<blockquote>\n<p>Independently, we care a lot about not breaking content, so at least in theory you shouldn't have to worry about old plug-ins not working anymore.</p>\n</blockquote>\n<p>That's great to hear! This is honestly the most important part for me.</p>\n<blockquote>\n<p>If an upgrade of <code>wasmtime</code> is ever difficult in the future, please feel free to file an issue and/or raise something on <a href=\"https://bytecodealliance.zulipchat.com/\">Zulip</a>.</p>\n</blockquote>\n<p>That's very kind and appreciated. Even though for now @bjorn3 is doing the bulk of the work and his contributions are very much appreciated - I'd like not to have to rely on him always being there.</p>\n<blockquote>\n<p>Does Zellij have an MSRV policy currently? Our choice of \"stable minus two\" is pretty arbitrary and changing that to three or four I don't think would be unreasonable if that would match Zellij.</p>\n</blockquote>\n<p>Generally no. I look at the MSRV as I do on our other dependencies - I would prefer never to have to update it/them and usually only do so if they contain critical security fixes that are relevant for us, if the version we're using is at its end of life or if we're asked to by one of our current or future packagers (eg. Debian - which is in the process of packaging wasmtime now btw).</p>\n<p>So whichever middle-ground you'd be comfortable with would be very welcome!</p>\n</blockquote>",
        "id": 495734447,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737731019
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2612952445\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>I've added an <a href=\"https://github.com/bytecodealliance/meetings/pull/524\">agenda item</a> for the next Wasmtime project meeting about discussing extending either our MSRV window or security release window to raise the discussion here.</p>\n<p>Otherwise thanks again for your feedback @imsnif it's quite valuable! I can otherwise reaffirm what @tschneidereit said in that:</p>\n<ul>\n<li>In-wasm content is highly unlikely to break between releases. Basically all users of Wasmtime have the same motivations as you which is to keep the same wasm blob running semantically the same way across releases.</li>\n<li>Wasmtime APIs are subject to breakage across releases but we also don't intentionally break things \"just because\". As @bjorn3 found the upgrade from 21 to 29 didn't result in any compiler errors at least and that's our goal otherwise. We do document all minor breaking changes in <code>RELEASES.md</code> for each release, however.</li>\n</ul>\n<p>Regardless now seems as good a time as any to consider the N constant in these two windows, so that's why I've added an agenda item for them.</p>\n</blockquote>",
        "id": 495753270,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737736851
    },
    {
        "content": "<p>imsnif <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2613002854\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Very cool! Thank you so much for giving this attention.</p>\n<p>Just something to consider regarding said N constant: when wasmtime for example gets packaged in debian, their support life cycle is significantly longer than the scale we're talking about here: <a href=\"https://www.debian.org/releases/\">https://www.debian.org/releases/</a> (tl;dr five years if my understanding is correct). So if it's interesting for you to also make the life of packagers easier with regards to security updates, it might be something you want to keep in mind.</p>\n</blockquote>",
        "id": 495757533,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737738356
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2613057491\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>One thing to add re: distribution/downstream packaging is that MSRV can be pretty important in that context: at one point I was trying to get Wasmtime working on OpenBSD (#2980) and their version of rustc is frozen at each release, so up to six months old. (<code>rustup</code> doesn't have binaries on that platform and it's pretty niche, so may not weigh too much here, but it's an example of timelines that our consumers may have that stretch longer than ours.)</p>\n</blockquote>",
        "id": 495761972,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737740103
    },
    {
        "content": "<p>bjorn3 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2613076229\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>For Debian you did only need an MSRV that matches the rustc in current unstable, right? But at the same time they need security updates for the Wasmtime version they packaged for the full lifecycle of the release. They aren't going to upgrade Wasmtime for the lifetime of the release once the feature freeze happens except for security releases. Even regular API/ABI compatible updates are not done except for a couple of packages like browsers.</p>\n</blockquote>",
        "id": 495763826,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737740785
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2614695178\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<blockquote>\n<p>eg. Debian - which is in the process of packaging wasmtime now btw</p>\n</blockquote>\n<p>As an aside, if you have any communications with the folks doing that: they appear to be <a href=\"https://sources.debian.org/src/rust-wasmtime/21.0.2%2Bdfsg-1.1/debian/patches/2002_no_wasm.patch/\">custom-patching Wasmtime to remove WASI</a>, which is fairly perplexing, and the comment on the patch suggests a misunderstanding that these are \"Wasm-only\" crates. I emailed the maintainer directly a bit ago when I first noticed this but never got a reply. They'll eventually find out it's essential when they try to package and test the CLI, but...</p>\n</blockquote>",
        "id": 496019882,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737941062
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2614698822\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<blockquote>\n<p>But at the same time they need security updates for the Wasmtime version they packaged for the full lifecycle of the release</p>\n</blockquote>\n<p>On the one hand, a five-year LTS release is a huge quantitative leap from our current policies; but on the other hand, if it's <em>one specific</em> release, then this actually doesn't seem too bad: it adds one more branch we need to consider whenever we have a CVE, and backport to if necessary; <code>rustup</code> should allow us to use the period-appropriate compiler to test the fix. (The ability to work in the snapshotted world seems like the biggest issue but crate version pinning and rustup have solved that IIUC.)</p>\n</blockquote>",
        "id": 496020223,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737941379
    },
    {
        "content": "<p>imsnif <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2615116372\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<blockquote>\n<p>As an aside, if you have any communications with the folks doing that: they appear to be <a href=\"https://sources.debian.org/src/rust-wasmtime/21.0.2%2Bdfsg-1.1/debian/patches/2002_no_wasm.patch/\">custom-patching Wasmtime to remove WASI</a>, </p>\n</blockquote>\n<p>All I know about is <a href=\"https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=1087400\">this thread</a>, but maybe @WeepingClown13 can help us out? (I hope the ping is alright)</p>\n</blockquote>",
        "id": 496061561,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1737966610
    },
    {
        "content": "<p>WeepingClown13 <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2620200128\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>I just caught up with the thread and regarding the WASI patch, I have to say that only Jonas (rust-wasmtime maintainer) knows the reason. Now, rust-wasmtime only provides cranelift currently, and nothing else (that includes wasmtime itself), and this - if it applies- <em>could be</em> a reason.</p>\n<p>As for Debian's support cycle, 5y is correct, and from the perspective of a maintainer who has to take into account the compatibility of a package with virtually every other pckage in the archive, I personally would like to see as less breaking changes as possible in packages. Constant MSRV bump in general could cause a lot of compatibility issues and it helps to keep the distance from the latest version at a reasonable amount (which I definitely feel isn't two). I am not sure about that specific number, that's more for the people who actually dangle in rust a lot to decide. If you would like to hear Debian specific perspectives, feel free to start a discussion by sending a mail to the debian rust team (<a href=\"mailto:debian-rust@lists.debian.org\">debian-rust@lists.debian.org</a>) and we are always happy to find consensus with upstreams.</p>\n</blockquote>",
        "id": 496436311,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1738103955
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2625493659\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>We discussed this in the Wasmtime meeting today and there are <a href=\"https://github.com/bytecodealliance/meetings/pull/534\">some notes here</a> and I've opened a dedicated <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10161\">issue about having an LTS</a></p>\n</blockquote>",
        "id": 496861303,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1738268373
    },
    {
        "content": "<p>imsnif <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2628911195\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>I don't want to cause undue noise in the neighboring LTS issue - so just to say this would be great and very much appreciated.</p>\n<p>Not sure what your issue closing policy for this repo is, but I'm happy to close this one or to have it closed at your preference.</p>\n</blockquote>",
        "id": 497155991,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1738408788
    },
    {
        "content": "<p>alexcrichton closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Hi wasmtime,</p>\n<p>It seems to me as if there's a major wasmtime version release every month or so. This is certainly a commendable cadence, but as a dependent of the runtime in a production environment this is a bit more than I can personally keep up with.</p>\n<p>I'm happy to stay with older versions - the only thing I'm worried about is security vulnerabilities. I tried to find some sort of document detailing how these are handled (if at all) in older versions but could not find anything.</p>\n<p>Could you help me out by pointing me in the right direction?</p>\n<p>Thanks!</p>\n</blockquote>",
        "id": 497476300,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1738598737
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2631428271\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Sounds good! I'll go ahead and close this but for those watching feel free to continue discussion either here or at #10161</p>\n</blockquote>",
        "id": 497476303,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1738598738
    },
    {
        "content": "<p>alexcrichton <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2767377464\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Closing the loop for anyone interested, <a href=\"https://docs.wasmtime.dev/stability-release.html\">Wasmtime 24</a> is now retroactively considered an LTS release for 2 years. Users of Wasmtime using an LTS release are recommended to upgrade once-per-year to the next LTS.</p>\n</blockquote>",
        "id": 509298464,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1743454523
    },
    {
        "content": "<p>imsnif <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2767387892\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>Thanks for the update! What would be your recommendation if we're already on 29.0.1 and would like an LTS?</p>\n</blockquote>",
        "id": 509299324,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1743454855
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2767408240\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>The two options would be:</p>\n<ul>\n<li>Downgrade to 24 LTS;</li>\n<li>Perform a monthly upgrade cadence (i.e., what you do currently to remain on a supported version) until 36 LTS is released in August of this year.</li>\n</ul>\n<p>I suppose the tradeoff depends on whether you're using features that only exist post-v24 and/or how quickly you want to get onto an LTS track.</p>\n</blockquote>",
        "id": 509301063,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1743455479
    },
    {
        "content": "<p>imsnif <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074#issuecomment-2768391787\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10074\">issue #10074</a>:</p>\n<blockquote>\n<p>We are not ourselves using new features afaik, but iirc some of our distributors asked for the upgrade - so I guess we'll wait for the next LTS and only upgrade before if there are critical security issues.</p>\n<p>Thanks to the project for providing an LTS!</p>\n</blockquote>",
        "id": 509374240,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1743491231
    }
]