[
    {
        "content": "<p>cfallin closed <a href=\"https://github.com/bytecodealliance/wasmtime/issues/2049\">issue #2049</a>:</p>\n<blockquote>\n<p>&lt;!-- Please try to describe precisely what you would like to do in<br>\nCranelift/Wasmtime and/or expect from it. You can answer the questions below if<br>\nthey're relevant and delete this text before submitting. Thanks for opening an<br>\nissue! --&gt;</p>\n<h4>Feature</h4>\n<p>Cranelift currently doesn't support SEH (but has some support for finally I think). This is a feature request to support properly exception (landingpads on Posix, SEH on windows, maybe SLJL for others)</p>\n<h4>Benefit</h4>\n<p>WASM has plans to support exceptions, at which point it's going to be needed. Win64 has partial SEH support (iirc it just emits what's needed, nothing more), this would allow for c++ /java/.net exception support.</p>\n<h4>Implementation</h4>\n<p>Tricky one. I know LLVM has two alternative ways of doing this. I think with that in mind it should be possible to do a single implementation. What's basically needed is a way to say:<br>\nfrom here<br>\n[code]</p>\n<p>till here is a protected block, on exceptions go to X, for finalization go to Y. For the handler itself it should be possible to define the personality to call.</p>\n<p>Throw, Rethrow etc can all probably be done on a library level.</p>\n<h4>Alternatives</h4>\n<p>The only alternative is to not do it.</p>\n</blockquote>",
        "id": 535422239,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1755746860
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/issues/2049#issuecomment-3208868933\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/issues/2049\">issue #2049</a>:</p>\n<blockquote>\n<p>Cranelift supports exceptions now, and they are used by Wasmtime exception handling and <code>cg_clif</code> panic-unwind support; closing issue.</p>\n</blockquote>",
        "id": 535422243,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1755746860
    }
]