[
    {
        "content": "<p>cfallin opened <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a> from <code>cfallin:you-get-a-code-segment-you-get-a-code-segment-everyone-gets-a-code-segment</code> to <code>bytecodealliance:main</code>:</p>\n<blockquote>\n<p>This will be needed to allow code-patching for our basic breakpoint strategy (see #11964). The idea is that when we have guest-debugging enabled in an engine's configuration, each store in that engine needs its own copy of each <code>CodeMemory</code> that executes any code with that store so that we can patch breakpoints.</p>\n<p>This PR first adds \"deep-cloning\" to the <code>MmapVec</code> and <code>CodeMemory</code> abstractions: the idea is that when possible, we re-map the underlying file with another private mapping, and otherwise, in the worst case (when we don't know the underlying file or when the image was provided to us as an external slice), we make a full copy into a new allocation.</p>\n<p>It then updates the per-store registry to track private copies of each <code>CodeMemory</code>, identified by <code>CompiledModuleId</code>, and deep-clone when it sees a new one for the first time. This is slightly subtle because of the way that components share a single CodeMemory (and do not have a CompiledModule) for all internal modules.</p>\n<p>This CodeMemory is then threaded through to the appropriate places that feed back pointers to the code: e.g., accessors for trampolines and Wasm function pointers require the specific code memory to be specified.</p>\n<p>Finally, at the instance level, we keep the instantiated CodeMemory alongside the Module in the <code>ModuleRuntimeInfo</code>.</p>\n<p>I went back and forth between a few different ways to plumb all this together. I'm not completely happy with the \"give me the CodeMemory you mean\" API for getting functions -- that could be a footgun. On the other hand, pushing the cloning upward causes a lot more churn, and bifurcates the core-module vs. component situation more. This still seems reasonably manageable in the sense that only a few specific accessors are affected and they are used only internally, in places where we have the <code>CodeMemory</code> right at hand from the particular instance or from the (updated) \"lookup module by PC\" helper on the store's registry. Happy to take ideas for a better design here if one occurs to someone!</p>\n<p>&lt;!--<br>\nPlease make sure you include the following information:</p>\n<ul>\n<li>\n<p>If this work has been discussed elsewhere, please include a link to that<br>\n  conversation. If it was discussed in an issue, just mention \"issue #...\".</p>\n</li>\n<li>\n<p>Explain why this change is needed. If the details are in an issue already,<br>\n  this can be brief.</p>\n</li>\n</ul>\n<p>Our development process is documented in the Wasmtime book:<br>\n<a href=\"https://docs.wasmtime.dev/contributing-development-process.html\">https://docs.wasmtime.dev/contributing-development-process.html</a></p>\n<p>Please ensure all communication follows the code of conduct:<br>\n<a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md\">https://github.com/bytecodealliance/wasmtime/blob/main/CODE_OF_CONDUCT.md</a><br>\n--&gt;</p>\n</blockquote>",
        "id": 558329646,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763599005
    },
    {
        "content": "<p><strong>cfallin</strong> requested <a href=\"https://github.com/fitzgen\">fitzgen</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>.</p>",
        "id": 558329648,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763599005
    },
    {
        "content": "<p><strong>cfallin</strong> requested <a href=\"https://github.com/orgs/bytecodealliance/teams/wasmtime-core-reviewers\">wasmtime-core-reviewers</a> for a review on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>.</p>",
        "id": 558329650,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763599005
    },
    {
        "content": "<p>cfallin updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>.</p>",
        "id": 558331846,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763600682
    },
    {
        "content": "<p>cfallin updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>.</p>",
        "id": 558331965,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763600772
    },
    {
        "content": "<p>cfallin updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>.</p>",
        "id": 558332789,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763601269
    },
    {
        "content": "<p>alexcrichton created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2550006143\">PR review comment</a>:</p>\n<blockquote>\n<p>Technically the trampoline accessors don't need a <code>CodeMemory</code> argument, right? We'll only be patching/changing \"finished functions\" so the new argument here and for wasm-&gt;array trampolines below might be able to be dropped?</p>\n</blockquote>",
        "id": 558686509,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763738523
    },
    {
        "content": "<p>alexcrichton created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2550017977\">PR review comment</a>:</p>\n<blockquote>\n<p>Since this doesn't actually use <code>&amp;self</code> at all here any more, maybe this could move to <code>CodeMemory</code> directly?</p>\n</blockquote>",
        "id": 558686510,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763738524
    },
    {
        "content": "<p>alexcrichton submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#pullrequestreview-3493050175\">PR review</a>:</p>\n<blockquote>\n<p>I've left a few comments here and there, but a high-level thought I had here is that I was originally hoping that it would be possible to use <code>Arc::get_mut</code> to dynamically prove that it's safe to mutate the memory. In reading over this though we have quite a lot of clones in quite a lot of places so I'm realizing that it may not be quite as applicable as previously thought. </p>\n<p>Another high-level thought though is that there's a fair bit of juggling of trying to make sure we're using the right code memory in the right context and it feels relatively cumbersome to maintain that everywhere.</p>\n<p>Would it be possible to maybe do the deep clone of-a-sort on the <code>Module</code> itself to avoid having to juggle one-vs-the-other? I'd ideally like to keep the self-contained nature of <code>Module</code> as-is where callers don't have to worry about passing in the right object or making sure they're dynamically selecting the right object. One semi-rough idea is that we could change the representation of <code>Module</code> to be an <code>enum</code> which is either \"pointer to the stuff\" or \"private code plus pointer to the stuff\"</p>\n</blockquote>",
        "id": 558686511,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763738524
    },
    {
        "content": "<p>alexcrichton created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2550025726\">PR review comment</a>:</p>\n<blockquote>\n<p>Technically I think this'll be wrong for private code memories? This sould use the \"active\" code as opposed to the default one, right?</p>\n</blockquote>",
        "id": 558686513,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763738524
    },
    {
        "content": "<p>alexcrichton created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2550001187\">PR review comment</a>:</p>\n<blockquote>\n<p>Although as I say we try to reduce clones... there's another map lookup here for <code>Instance::new</code>-style constructors and then there's also <code>module.clone()</code> below. So maybe we have some refactoring to do to reduce all the clones here...</p>\n</blockquote>",
        "id": 558686514,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763738524
    },
    {
        "content": "<p>alexcrichton created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2549988607\">PR review comment</a>:</p>\n<blockquote>\n<p>Similar comment to components above -- I think this new argument to <code>register_module</code> can be dropped and the engine can be derived from the module itself</p>\n</blockquote>",
        "id": 558686515,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763738524
    },
    {
        "content": "<p>alexcrichton created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2550105634\">PR review comment</a>:</p>\n<blockquote>\n<p>To avoid having to re-guess what the alignment is here, could the alignment be passed in to more constructors?</p>\n</blockquote>",
        "id": 558686516,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763738524
    },
    {
        "content": "<p>alexcrichton created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2549985789\">PR review comment</a>:</p>\n<blockquote>\n<p>Given that this is the hot path of instantiation I'd like to try to keep clones out of this path where possible. For this I think the engine is reachable via the <code>component</code> in addition to the store, so could the new <code>engine</code> argument to <code>register_component</code> come from <code>component.engine()</code> instead? (may not end up needing a new argument in that case)</p>\n</blockquote>",
        "id": 558686517,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763738524
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#issuecomment-3563798362\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>:</p>\n<blockquote>\n<p>Thanks for your comments @alexcrichton! A high-level discussion point:</p>\n<blockquote>\n<p>Another high-level thought though is that there's a fair bit of juggling of trying to make sure we're using the right code memory in the right context and it feels relatively cumbersome to maintain that everywhere.</p>\n<p>Would it be possible to maybe do the deep clone of-a-sort on the Module itself to avoid having to juggle one-vs-the-other? I'd ideally like to keep the self-contained nature of Module as-is where callers don't have to worry about passing in the right object or making sure they're dynamically selecting the right object. One semi-rough idea is that we could change the representation of Module to be an enum which is either \"pointer to the stuff\" or \"private code plus pointer to the stuff\"</p>\n</blockquote>\n<p>I think this is the <a href=\"https://github.com/cfallin/wasmtime/blob/36e1bc64f9c3231f659965ed7c3b62a9d8c17958/crates/wasmtime/src/runtime/vm.rs#L303-L313\"><code>ModuleRuntimeInfo</code></a> with my changes -- it goes from a simple <code>Module</code> to a <code>Module</code> plus <code>Arc&lt;CodeMemory&gt;</code>.</p>\n<p>In a little more detail: I did explore the \"clone all the way up\" approach before taking the current direction, and the main issue I came across was that (to say it bluntly) \"it's a lie\": in the presence of introspection APIs, e.g. the ability to get a module from an <code>Instance</code> handle (and for one to get all instances via debugging introspection APIs), we want the same module to be the same. It also adds a lot more cloning cost obviously, which can be mitigated with a bunch of internal <code>Arc</code>s, but that's not great either. (It puts most of the cost in the debugging case rather than base case, but does mean there are more indirections in the base case.)</p>\n<p>My thought was that the <code>ModuleRuntimeInfo</code> would be the place where a module is joined together with a particular copy of its code. The most proper (\"most truthful\") refactor from there would be to remove all code-related accessors from <code>Module</code> and put them on <code>ModuleRuntimeInfo</code> instead, but that's also a large refactor that affects a bunch of callsites. Actually now that I think about it, though -- I had been worried about the accessors that fetch data from the image rather than return pointers to code (Wasm data, exception table, ...) and what they would do, but we could create an ad-hoc <code>ModuleRuntimeInfo</code> at that point. Or describe the abstraction as a new <code>ModuleWithCode</code>, replace <code>ModuleRuntimeInfo::Module</code>'s payload with that, and hang all the accessors that need code off <code>ModuleWithCode</code>. Then we can get a \"module with default code\" from the <code>Module</code> itself if we know we aren't going to return pointers to it.</p>\n<p>What do you think?</p>\n</blockquote>",
        "id": 558704043,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763742833
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#issuecomment-3563931829\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>:</p>\n<blockquote>\n<blockquote>\n<p>Then we can get a \"module with default code\" from the Module itself if we know we aren't going to return pointers to it.</p>\n</blockquote>\n<p>And, actually, as a refinement on that: we could do some type-system shenanigans so that a \"module with default code\" is not allowed to return raw code pointers, only other (meta)data from the image, while a \"module with code\" obtained from an instance is.</p>\n</blockquote>",
        "id": 558711991,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763745049
    },
    {
        "content": "<p>fitzgen <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#issuecomment-3563939319\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>:</p>\n<blockquote>\n<blockquote>\n<p>but that's also a large refactor that affects a bunch of callsites.</p>\n</blockquote>\n<p>But it also sounds really nice...</p>\n<p>Spitballing without having dug into the PR yet: is it possible that some lsp actions could help make this mass refactor easier?</p>\n</blockquote>",
        "id": 558712368,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763745181
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#issuecomment-3563964529\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>:</p>\n<blockquote>\n<p>Yeah, I guess \"large refactor that affects a lot of callsites\" was my reason for not doing it so far, but I'm happy to do it to get the right conceptual model.</p>\n<p>To be clear, that's <code>ModuleWithCode</code> and moving image-related accessors onto that (and getting at them from the <code>ModuleRuntimeInfo</code>), not clone-<code>Module</code>-all-the-way-up. @alexcrichton does this sound good to you? I want to make sure you're onboard before I spend a day doing this :-)</p>\n</blockquote>",
        "id": 558713713,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763745621
    },
    {
        "content": "<p>fitzgen created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2550527225\">PR review comment</a>:</p>\n<blockquote>\n<p>I originally expected this to be an assert that the entry was not occupied, but I double checked and we do in fact potentially register the same code multiple times (e.g. we register a module's code on each <code>Instance::new</code> call and you can obviously instantiate the same module multiple times in the same store).</p>\n<p>This subtlety pushes me towards asking for some kind of assertion that the existing private code object matches our <code>code_object</code> parameter, but I don't see how that is really possible without a full byte-for-byte comparison of the whole mmap, which seems like it is probably too expensive.</p>\n<p>So ultimately maybe we just expand this method's doc comment to note that the method is idempotent and that modules will be registered multiple times in certain scenarios? That reminder/context probably would have let me avoid going down this rabbit hole.</p>\n<p>Or maybe we should invert some logic here, and <em>always</em> use <code>self.private_code</code> (after renaming it to something like <code>self.registered_code</code>) so that we can super easily tell if a code object is already registered and return early if so, without needing to actually do the careful text range queries below? I think this inversion would make the idempotency logic much clearer. Thoughts?</p>\n</blockquote>",
        "id": 558727648,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763749972
    },
    {
        "content": "<p>fitzgen submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#pullrequestreview-3493711812\">PR review</a>:</p>\n<blockquote>\n<p>To briefly repeat some comments from DM: I am in favor of the refactor discussed in this PR's main thread where</p>\n<ul>\n<li>we create a type separation between the shared code at the engine level and the (potentially private copy) code used at the store level</li>\n<li>all accessors for function pointers and such move to the store-level code type (or a <code>Module</code> and store-level code pair type)</li>\n<li>the act of creating the store-level code is the thing one place we are making a private copy or reusing the shared copy</li>\n</ul>\n<p>bikeshedding names for these two new types:</p>\n<ul>\n<li><code>EngineCode</code> and <code>StoreCode</code></li>\n<li><code>CodeModule</code> and <code>CodeInstance</code></li>\n<li><code>CodeFactory</code> and <code>CodeInstance</code> lol</li>\n</ul>\n</blockquote>",
        "id": 558727649,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763749972
    },
    {
        "content": "<p>fitzgen created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2550472860\">PR review comment</a>:</p>\n<blockquote>\n<p>We should probably have tests for non-aligned inputs to <code>deserialize_raw</code> if we don't already.</p>\n<p>But also, this seems like the kind of thing where we can simply update the invariants of <code>deserialize_raw</code> if it becomes overly constraining. <em>shrug</em></p>\n</blockquote>",
        "id": 558727651,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763749973
    },
    {
        "content": "<p>fitzgen created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2550539555\">PR review comment</a>:</p>\n<blockquote>\n<p>I know this bit might go away after the refactoring we have been discussing in the main comment thread for this PR, but if not:</p>\n<p>It would be good to clarify <em>why</em> it is okay to do this for trampolines to host functions (we never have private copies of host functions so we don't need to worry about which copy of the code we are using) because it is <em>not</em> okay to use the default code memory for trampolines to Wasm functions (and a reader might otherwise mistakenly believe it is okay to use the default code memory for all trampolines, without the suggested context added to the comment).</p>\n</blockquote>",
        "id": 558727652,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1763749973
    },
    {
        "content": "<p>cfallin <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#issuecomment-3583534384\">commented</a> on <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>:</p>\n<blockquote>\n<p>Just an update on progress here: I'm <a href=\"https://github.com/cfallin/wasmtime/tree/code-segments-for-everyone\">midway through the refactor</a>, and it's proving quite a lot more invasive than I had hoped. On the positive side, I've worked out a way to have truly unique ownership of a <code>StoreCode</code>, so mutation can be proved to be safe given a mut borrow of the <code>Store</code>. But in terms of impact, this is very deeply invasive, and I worry that (for example) indirect function calls are going to be penalized: lazily setting up the funcref now requires looking up the <code>StoreCode</code> for the module in question, so rather than a few fast array accesses in the <code>CompiledModule</code>, we have a BTree lookup. The impact on the guest profiler is pretty deep (it handles all its metadata regarding PCs at the module level) and <code>InstancePre</code> (though the latter may be OK only if we allow executing Wasm-to-array trampolines in the <em>engine</em> code rather than the <em>store</em> code, allowing pre-resolution of host funcrefs; this breaks a desirable invariant that we never execute engine code directly though).</p>\n<p>I'll keep plugging away at this, but just wanted to surface the cost of the above requested refactor :-) I will say that with the types as now defined, I feel much more reasonable about having not missed any place that would execute the wrong copy of code.</p>\n</blockquote>",
        "id": 560492692,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1764199718
    },
    {
        "content": "<p>cfallin updated <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>.</p>",
        "id": 560954296,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1764460382
    },
    {
        "content": "<p>cfallin submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#pullrequestreview-3520875313\">PR review</a>.</p>",
        "id": 560954373,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1764460476
    },
    {
        "content": "<p>cfallin created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2573255806\">PR review comment</a>:</p>\n<blockquote>\n<p>Yes, the logic here is pre-existing and a little weird, but appears to be necessary because of the way that modules within a component share one compiled artifact (or at least, without a deeper refactor of the whole components runtime). I've added more doc-comments in the refactor on the <code>ModuleRegistry</code> that hopefully address this (most of this file is new now as well).</p>\n</blockquote>",
        "id": 560954374,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1764460476
    },
    {
        "content": "<p>cfallin submitted <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#pullrequestreview-3520875595\">PR review</a>.</p>",
        "id": 560954458,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1764460566
    },
    {
        "content": "<p>cfallin created <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#discussion_r2573256319\">PR review comment</a>:</p>\n<blockquote>\n<p>Yep, I've added some more comments to this effect, and also had to add a <code>store_invariant_func(..)</code> accessor and a notion of <code>FuncKey::is_store_invariant</code> to make this concept explicit. I've documented it more in the appropriate comment locations as well as the new commit message -- basically the structure of the component runtime and also <code>InstancePre</code> both require us to use engine-wide trampoline pointers in some places currently, and that's fine for trampolines that go out of Wasm (Wasm-to-array and Wasm-to-builtin).</p>\n</blockquote>",
        "id": 560954459,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1764460566
    },
    {
        "content": "<p>cfallin edited <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051\">PR #12051</a>:</p>\n<blockquote>\n<p>This will allow patching code to implement e.g. breakpoints. (That is, for now the copies are redundant, but soon they will not be.)</p>\n<p>This change follows the discussion [here] and offline to define a few types that better encapsulate the distinction we want to enforce. Basically, there is almost never a bare <code>CodeMemory</code>; they are always wrapped in an <code>EngineCode</code> or <code>StoreCode</code>, the latter being a per-store instance of the former. Accessors are moved to the relevant place so that, for example, one cannot get a pointer to a Wasm function's body without being in the context of a <code>Store</code> where the containing module has been registered. The registry then returns a <code>ModuleWithCode</code> that boxes up a <code>Module</code> reference and <code>StoreCode</code> together for cases where we need both the metadata from the module and the raw code to derive something.</p>\n<p>The only case where we return raw code pointers to the <code>EngineCode</code> directly have to do with Wasm-to-array trampolines: in some cases, e.g. <code>InstancePre</code> pre-creating data structures with references to host functions, it breaks our expected performance characteristics to make the function pointers store-specific. This is fine as long as the Wasm-to-array trampolines never bake in direct calls to Wasm functions; the strong invariant is that Wasm functions never execute from <code>EngineCode</code> directly. Some parts of the component runtime would also have to be substantially refactored if we wanted to do away with this exception.</p>\n<p>The per-<code>Store</code> module registry is substantially refactored in this PR. I got rid of the modules-without-code distinction (the case where a module only has trampolines and no defined functions still works fine), and organized the BTreeMaps to key on start address rather than end address, which I find a little more intuitive (one then queries with the dual to the range -- 0-up-to-PC and last entry found).</p>\n<p>[here]: <a href=\"https://github.com/bytecodealliance/wasmtime/pull/12051#pullrequestreview-3493711812\">https://github.com/bytecodealliance/wasmtime/pull/12051#pullrequestreview-3493711812</a></p>\n</blockquote>",
        "id": 560954524,
        "sender_full_name": "Wasmtime GitHub notifications bot",
        "timestamp": 1764460648
    }
]