[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"254389\">@Chris Fallin</span> without urgency: can you tell me which of the <a href=\"https://github.com/bytecodealliance/gecko-dev/commits/7acfe5fcdb611518ecc36f5720cb784fdda1ad08/\">gecko-dev patches</a> we can drop because they have since been upstreamed? It's awfully hard to figure that out with pointer-hopping from git to hg to BMO</p>",
        "id": 511701139,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1744392384
    },
    {
        "content": "<p>Hi Till! So the work is upstreamed through AOT ICs (<code>0044c7a</code> in that series); however there is some divergence with upstream reviews and reorganization and the rest will likely not apply cleanly unfortunately</p>",
        "id": 511702094,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1744392674
    },
    {
        "content": "<p>I started to work on this at one point a month ago and I was running into mysterious test failures -- I suspect this is a deep rabbit hole. Unfortunately I don't have the cycles to push it forward right now, sorry :-(</p>",
        "id": 511702156,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1744392700
    },
    {
        "content": "<p>that's helpful context, thank you.</p>\n<p>It's a bit unfortunate, as we currently can't update the version of wasi-sdk used by StarlingMonkey, because for that we'd have to rebuild the SpiderMonkey object files—which doesn't work with newer wasi-sdks at the current revision. Which wouldn't be the end of the world, except CMake 4.0 was released recently, and the current version of wasi-sdk uses a config file that CMake doesn't like anymore <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>",
        "id": 511702706,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1744392893
    },
    {
        "content": "<p>anyway, I'll find ways to hack around all this for now</p>",
        "id": 511702734,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1744392903
    },
    {
        "content": "<p>Oh dear, that's quite the interconnected mess... yeah, I need to get this done eventually, I know it's holding things back; I'm likely to have more free time in August or September (after an internal demo/sprint) unless I reshuffle things some other way</p>",
        "id": 511702986,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1744392980
    },
    {
        "content": "<p>yeah, I know you're busy with internal things. For now I'll see if updating to the last Gecko LTS is an alternative</p>",
        "id": 511703565,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1744393200
    },
    {
        "content": "<p>An update on this effort: I've spent the past three days on this and have a <a href=\"https://github.com/cfallin/gecko-dev/tree/cfallin/upstream-weval-annotations\">branch</a> on which I'm testing things. The version of PBL here passes all JIT-tests still in interpreter mode. Unfortunately when wevaling, I'm running into some really odd code-patterns that modern LLVM is generating in the Wasm -- in particular, it seems to be tail-merging specialized and non-specialized paths in a way that breaks weval's context tracking and causes processing errors. I'm trying to work out a way to either guide the compiler with intrinsics (possibly workable, but brittle) or build stronger optimizations/preprocessing steps into weval to make this work.</p>\n<p>(In a little more detail: there is an extremely maddening code sequence that LLVM is generating where, on checking for error after an IC return, we're supposed to be in shared tail-call-into-interpreter slowpath code; but it's merging this path with the happy path, then doing another redundant check of the error code and then branching to the slowpath. I suspect this may be some weird relooper thing to avoid irreducible control flow, somehow reusing some path-dependent value for the condition/flag. It will require something like path-sensitive constant propagation to peel it apart again.)</p>\n<p>tl;dr -- trying to update, but compilers getting smarter is making my life hard</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/cfallin/gecko-dev/tree/cfallin/upstream-weval-annotations\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/e4155abefdbc1d87d43e2d06b2179b496bd318b5/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f623636393338666665343765633736363663393063336331663038666166663333396462393563343639326434653333333537336162623935306364363139662f6366616c6c696e2f6765636b6f2d646576&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/cfallin/gecko-dev/tree/cfallin/upstream-weval-annotations\" title=\"GitHub - cfallin/gecko-dev at cfallin/upstream-weval-annotations\">GitHub - cfallin/gecko-dev at cfallin/upstream-weval-annotations</a></div><div class=\"message_embed_description\">Read-only Git mirror of the Mercurial gecko repositories at https://hg.mozilla.org. How to contribute: https://firefox-source-docs.mozilla.org/contributing/contribution_quickref.html - GitHub - cfa...</div></div></div>",
        "id": 526881342,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1751491476
    },
    {
        "content": "<p>(OK, in typical darkest-before-dawn fashion that seems to repeatedly happen when I hit a wall -- it turns out that weval is a nice context-specializing machine; that's its whole deal; so I can context-specialize my way out of LLVM's tail-merging. Some other hiccups with AOT ICs it seems but maybe will have an update working in a bit that I can then rebase the rest of StarlingMonkey's patches onto and test with integration tests...)</p>",
        "id": 526896419,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1751500954
    },
    {
        "content": "<p>So I've got a bit more working on that branch, but I'm still hitting unweval'able IC bodies that seem to be coming from some out-of-sync definition in PBL's IC interpreter not caught by upstream tests (leading to garbage during partial eval). I'll keep working on this.</p>\n<p>In the meantime, once I get the PBL rebase working, it would be useful to have the rest-of-the-owl ready for me to combine with it to run StarlingMonkey's integration tests -- i.e., all of the BYOB-stream patches, etc. <span class=\"user-mention\" data-user-id=\"234973\">@Till Schneidereit</span> or others, is there a branch somewhere with a recent rebase of all of that? E.g. a branch with everything but the weval patches rebased to latest release or <code>main</code> would be a very useful starting point for me. I can tackle this at some point if others don't but I'll be more out of my depth. Thanks!</p>",
        "id": 527068252,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1751574372
    },
    {
        "content": "<p>OK, I'm going to give a somewhat unfortunate update here: I don't think updating the Gecko version that we support with AOT compilation is going to be feasible without substantial additional engineering.</p>\n<p>The problem I've been banging into now is that LLVM seems to be doing some much more clever relooper-pass transforms (Wasm structured control flow reconstruction) where it re-uses branch conditions in ways that merge together different control flow paths statically, but reuse existing branch conditions to separate them dynamically. So when we have the weval traversal visit a particular opcode case that has an early out (e.g. an IC guard failure), we see something like: <code>if (x != k) goto bail; fallthrough...</code> but the <code>goto bail</code> path goes <em>through</em> a common exit block with <code>fallthrough</code>, and the <code>x != k</code> test is repeated further down to actually bail.</p>\n<p>To maintain context specialization that allows weval to statically lay out the compiled code, it needs to reason about the two paths through that common exit block separately. But even if I use a nested context to try to do that, when we visit the common block in the exit context, we see a <em>statically possible</em> edge back to the top of the interpreter loop. This edge is never actually taken, because we're already in the <code>x != k</code> case and the edge is guarded with <code>x == k</code>. But weval doesn't have SCCP or equivalent that can track path-specific constant facts.</p>\n<p>In <a href=\"https://github.com/bytecodealliance/weval/tree/cfallin/value-specialization\">this branch</a> I've been building out some infrastructure that tries to do that, but the problem is that we don't directly pass a value through the branch-args that can be value-specialized; we see a branch on <code>x != k</code> and then we have to scan all other values in-scope and reason about them and potentially update their abstract analysis state. That's an ugly and non-scalable O(n^2) analysis problem.</p>\n<p>So the tl;dr here is: LLVM got smarter in its generated Wasm; weval needs too much (non-scalable, non-feasible, non-tractable?) analysis to see through it; it's both unclear whether this is possible at all, and the exploration to know for sure is too much of a deep-dive for me to reasonably spend time on it. (A real fix here would need months of full-time probably, which is not something I have.)</p>\n<p>Anyway, my recommendation is that if the SpiderMonkey update is more important, let's drop AOT; or if losing the 3-5x speedup would be too painful, then we're stuck on v127 and an older wasi-sdk for a while more. Sorry!</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/weval/tree/cfallin/value-specialization\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/03f16517db5c54268e8e267cd473364ec70ee3ce/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f653537613130316539383963663765666464303965643236653733383562326535653133666533313838663664343031303834383533363038626435373466632f62797465636f6465616c6c69616e63652f776576616c&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/weval/tree/cfallin/value-specialization\" title=\"GitHub - bytecodealliance/weval at cfallin/value-specialization\">GitHub - bytecodealliance/weval at cfallin/value-specialization</a></div><div class=\"message_embed_description\">the WebAssembly partial evaluator. Contribute to bytecodealliance/weval development by creating an account on GitHub.</div></div></div>",
        "id": 527089464,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1751588145
    },
    {
        "content": "<p>Hmm, actually, there might be a way to throw some big-hammer intrinsics at this -- \"unreachable if [context condition]\" and basically force the specialization walk to terminate if it follows an edge we know is dynamically invalid. (I'm vacillating between \"grad student mode\" and \"actually take the three-day weekend\", sigh)</p>",
        "id": 527092072,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1751590910
    },
    {
        "content": "<p>OK, yeah, that leads to further problems. There's a meta-problem of brittleness here where we rely too much on the shape of the toolchain in ways that can change; that only works if there's a full team tracking this, not little slices of my time. This is pretty insurmountable. Sorry!</p>",
        "id": 527093371,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1751592088
    },
    {
        "content": "<p>Thank you for digging into this, and the thorough reports, Chris!</p>\n<p>The conclusions seem pretty unfortunate, but like something we'll have to live with for now. One thing that might still be worth looking into: is there maybe some flag we can pass to llvm to change the codegen? Perhaps this is the result of a new pass, which we could disable?</p>\n<p>Regardless, I'll prepare the branch you mentioned, of all non-BPL patches on current FF release. We can then either ship that without weval, or maybe we get really lucky and my suggestion above or some other hail-mary allows us to use weval after all</p>",
        "id": 527426927,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1751877345
    },
    {
        "content": "<p>After a weekend of being really really bothered by this, I'm digging in more, and I'm just implementing SCCP. Branch linked above has weval with propagation of == / != conditions; debugging a few more is showing I need inequality propagation too (one branch tests <code>x &lt; y</code>, another tests <code>z &lt; w</code> where <code>z</code> and <code>w</code> are aliases via blockparams for <code>x</code> and <code>y</code>, and we need to only visit paths where these branches go the same way). This is making the cprop lattice more complex too (already have \"this concrete value\" and \"some value that is not this concrete value\", now will need ranges too) but this is tractable -- would rather make the tool more general like this. 75% chance of working -- no promises yet...</p>",
        "id": 527577620,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1751928428
    },
    {
        "content": "<p>OK, yeah, this is turning into an even deeper rabbithole. I implemented range-tracking (including the hairy off-by-one cases because LLVM is apparently smart enough to generate <code>i32.le_u</code> with <code>k</code> then <code>i32.lt_u</code> with <code>k + 1</code> elsewhere) but it looks like I also need conditional/path-sensitive blockparam elimination (!!) to make this work -- omg llvm why?!</p>\n<p>I suspect that the annotate-unreachable-with-intrinsics could work with a bit more thought but I'm gonna timebox myself here. (Couldn't find options to change the behavior in LLVM either -- this seems like some deep optimizer/Wasm backend change, not an optional pass doing something) Wasm exceptions also need doing and have less variance in completion time, so I'll spend time on that, and come back to this later.</p>",
        "id": 527622485,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1751960734
    },
    {
        "content": "<p>preserve the brain. this is a hard problem. you can come back to it having relaxed the brain a bit.</p>",
        "id": 527672801,
        "sender_full_name": "Ralph",
        "timestamp": 1751976910
    },
    {
        "content": "<p>An update on this: I put a few more days into it; through some truly wacky path-sensitive constant propagation magic, as well as some just-so tweaks to context updates, I have a working SpiderMonkey-on-weval again for <em>one</em> Octane benchmark, Richards, at <a href=\"https://github.com/cfallin/gecko-dev/tree/cfallin/upstream-weval-annotations\">this gecko-dev branch</a> and <a href=\"https://github.com/bytecodealliance/weval/tree/cfallin/value-specialization\">this weval branch</a>.</p>\n<p>Unfortunately after getting that working, I then expanded to the rest of Octane, and found a number of other \"partial evaluation ran off the end because of path-merging\" kinds of errors, and...</p>\n<p>... I think I'm going to admit defeat here: new LLVM is doing stuff that is too weird, and it's not viable to partial-evaluate its output. Anyone who wants the 3-5x perf improvements from weval should use the old StarlingMonkey. Sorry!</p>\n<p>Long-term, the more maintainable solution is probably to spend ~1-1.5 years fulltime building a dedicated AOT compiler in the \"traditional\" way, after building out debugging facilities in Wasmtime so that we have adequate abilities to bring it up. I picked partial eval because it was the right way to get a fully compatible, fully AOT thing working \"quickly\" (~1 year), was viable to develop the JS semantics part mostly on native (without good Wasm debug facilities), and should have been great for shared maintenance effort with non-Wasm folks. Unfortunately I didn't foresee LLVM becoming too clever here, and didn't foresee the debugging difficulties that would have me grepping through 1M-line logs of compiler traces and IR for days...</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/cfallin/gecko-dev/tree/cfallin/upstream-weval-annotations\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/e4155abefdbc1d87d43e2d06b2179b496bd318b5/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f623636393338666665343765633736363663393063336331663038666166663333396462393563343639326434653333333537336162623935306364363139662f6366616c6c696e2f6765636b6f2d646576&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/cfallin/gecko-dev/tree/cfallin/upstream-weval-annotations\" title=\"GitHub - cfallin/gecko-dev at cfallin/upstream-weval-annotations\">GitHub - cfallin/gecko-dev at cfallin/upstream-weval-annotations</a></div><div class=\"message_embed_description\">Read-only Git mirror of the Mercurial gecko repositories at https://hg.mozilla.org. How to contribute: https://firefox-source-docs.mozilla.org/contributing/contribution_quickref.html - GitHub - cfa...</div></div></div><div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/weval/tree/cfallin/value-specialization\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/4472c2028b558e56015611eaa732775423ecd02d/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f303166363231313238636561666534613632393862323666616266383366346364613666393363366662656463383664363964623962643963373563306532302f62797465636f6465616c6c69616e63652f776576616c&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/weval/tree/cfallin/value-specialization\" title=\"GitHub - bytecodealliance/weval at cfallin/value-specialization\">GitHub - bytecodealliance/weval at cfallin/value-specialization</a></div><div class=\"message_embed_description\">the WebAssembly partial evaluator. Contribute to bytecodealliance/weval development by creating an account on GitHub.</div></div></div>",
        "id": 536512308,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1756340287
    },
    {
        "content": "<p>How feasible would it be to add a flag to LLVM to disable this path merging optimization?</p>",
        "id": 536546754,
        "sender_full_name": "bjorn3",
        "timestamp": 1756366439
    },
    {
        "content": "<p>Possibly? I did root around a bit to see if I could identify any recently-changed bits in the Wasm backend, and didn't see anything obvious at least. Perhaps <span class=\"user-mention\" data-user-id=\"254083\">@Dan Gohman</span> could help at some point (I know weval-based perf is important to you!)</p>",
        "id": 536639226,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1756396743
    },
    {
        "content": "<blockquote>\n<p>I did root around a bit to see if I could identify any recently-changed bits in the Wasm backend</p>\n</blockquote>\n<p>I was wondering if bisecting LLVM to pin the last working commit would be both feasible and valuable? For this, we would likely need a minimal reproducible example that can serve as a test case.</p>",
        "id": 536640892,
        "sender_full_name": "Tomasz Andrzejak",
        "timestamp": 1756397215
    },
    {
        "content": "<p>Sure, yep, that would be ideal -- right now the repro is \"build SpiderMonkey and then try to weval Octane\". At some point in another timebox (not now!) I can try to reproduce the path merging with a little standalone C program or something</p>",
        "id": 536646669,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1756399323
    },
    {
        "content": "<blockquote>\n<p>build SpiderMonkey and then try to weval Octane</p>\n</blockquote>\n<p>Well, if you think it's worthwhile, I could try to help and  bisect using this repro. Building both clang and SpiderMonkey \"shouldn't\" be too bad with ccache -- I hope <span aria-label=\"fingers crossed\" class=\"emoji emoji-1f91e\" role=\"img\" title=\"fingers crossed\">:fingers_crossed:</span>  . Do you have any scripts/environment that would be useful ? <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 536658426,
        "sender_full_name": "Tomasz Andrzejak",
        "timestamp": 1756403854
    },
    {
        "content": "<p>the above links to branches (I just pushed the mozconfig to gecko-dev); then</p>\n<div class=\"codehilite\" data-code-language=\"Rust\"><pre><span></span><code><span class=\"cp\">$</span><span class=\"w\"> </span><span class=\"n\">cd</span><span class=\"w\"> </span><span class=\"n\">weval</span><span class=\"o\">/</span><span class=\"p\">;</span><span class=\"w\"> </span><span class=\"n\">cargo</span><span class=\"w\"> </span><span class=\"n\">build</span><span class=\"w\"> </span><span class=\"o\">--</span><span class=\"n\">release</span>\n<span class=\"cp\">$</span><span class=\"w\"> </span><span class=\"n\">cd</span><span class=\"w\"> </span><span class=\"o\">../</span><span class=\"n\">gecko</span><span class=\"o\">-</span><span class=\"n\">dev</span><span class=\"o\">/</span><span class=\"p\">;</span><span class=\"w\"> </span><span class=\"n\">MOZCONFIG</span><span class=\"o\">=</span><span class=\"n\">weval</span><span class=\"o\">-</span><span class=\"n\">mozconfig</span><span class=\"w\"> </span><span class=\"p\">.</span><span class=\"o\">/</span><span class=\"n\">mach</span><span class=\"w\"> </span><span class=\"n\">build</span>\n<span class=\"cp\">$</span><span class=\"w\"> </span><span class=\"o\">../</span><span class=\"n\">weval</span><span class=\"o\">/</span><span class=\"n\">target</span><span class=\"o\">/</span><span class=\"n\">release</span><span class=\"o\">/</span><span class=\"n\">weval</span><span class=\"w\"> </span><span class=\"n\">weval</span><span class=\"w\"> </span><span class=\"o\">--</span><span class=\"n\">show</span><span class=\"o\">-</span><span class=\"n\">stats</span><span class=\"w\"> </span><span class=\"o\">-</span><span class=\"n\">w</span><span class=\"w\"> </span><span class=\"o\">-</span><span class=\"n\">i</span><span class=\"w\"> </span><span class=\"n\">obj</span><span class=\"o\">-</span><span class=\"n\">weval</span><span class=\"o\">/</span><span class=\"n\">dist</span><span class=\"o\">/</span><span class=\"n\">bin</span><span class=\"o\">/</span><span class=\"n\">js</span><span class=\"w\"> </span><span class=\"o\">-</span><span class=\"n\">o</span><span class=\"w\"> </span><span class=\"n\">octane</span><span class=\"p\">.</span><span class=\"n\">weval</span><span class=\"p\">.</span><span class=\"n\">wasm</span><span class=\"w\"> </span><span class=\"o\">&lt;</span><span class=\"w\"> </span><span class=\"n\">octane</span><span class=\"p\">.</span><span class=\"n\">js</span>\n</code></pre></div>\n<p>this should fail with a bunch of debug output from weval, with the version of clang/LLVM pulled down by the mozbuild infrastructure. You'll need to override the C/C++ compiler used in the mozconfig if building with a custom LLVM, I think</p>",
        "id": 536659477,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1756404214
    },
    {
        "content": "<p>it's entirely possible that in my messing around with path-sensitive constant prop, I will have broken something else once the path-merging issue is taken away; the only real way to know is to look at the trace output (<code>RUST_LOG=weval=trace RAYON_NUM_THREADS=1 weval ...</code>) which is gigabytes of meaningless mush for anyone who isn't me :-)</p>",
        "id": 536659861,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1756404359
    }
]