[
    {
        "content": "<p>Is it possible to link two Wasm components at runtime with the <code>wasmtime::component::Linker</code>?</p>\n<p>I have one component exporting one function and another component importing that function. I instantiate the component with the export in the linker and then try to instantiate the component importing that function but get an error message saying a matching implementation was not found in the linker. Is this supported without adding a hostcall implementation for the import that calls the export of the other component?</p>",
        "id": 527502838,
        "sender_full_name": "Jeff Charles",
        "timestamp": 1751901450
    },
    {
        "content": "<p>Not currently, no, it's required that the values travel through the host or that the component is composed ahead of time with tooling such as <code>wac</code></p>",
        "id": 527504016,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1751901821
    },
    {
        "content": "<p>For having the values travel through the host, is there an example you can point me to?</p>",
        "id": 527505552,
        "sender_full_name": "Jeff Charles",
        "timestamp": 1751902285
    },
    {
        "content": "<p>I don't have an exact example off-hand but one example would be to use <code>func_new</code> plus <code>Func::call</code> to funnel everything through <code>component::Val</code>. That may not be super efficient depending on the context though so if you know the types ahead of time you can use the typed versions of the APIs</p>",
        "id": 527505847,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1751902380
    },
    {
        "content": "<p>I know the types involved so I'll use the typed APIs. Thanks for the help!</p>",
        "id": 527506692,
        "sender_full_name": "Jeff Charles",
        "timestamp": 1751902649
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"477345\">Jeff Charles</span> has marked this topic as resolved.</p>",
        "id": 527507024,
        "sender_full_name": "Notification Bot",
        "timestamp": 1751902755
    }
]