[
    {
        "content": "<p>Hey all, I'm trying to mess around with hacking together some WIT interfaces / worlds for reactive user interfaces. Since async / streams are not currently stable (and I'm also not sure whether or not they are the most appropriate API for my use case anyway), I'm trying to hack something together using callbacks for right now.</p>\n<p>I've gotten pretty far, but I'm running into a <code>wasm trap: cannot enter component instance</code> and I'm unsure how to proceed. So I was wondering if there were any examples already out there of what I'm trying to do.</p>\n<p>Basically to hack callbacks in the current component model, I'm importing a register callback function (<code>add-on-update-handler: func(callback-id: callback-id);</code>), and exporting a function to actually call the callback in the guest (<code>call-callback: func(callback-id: callback-id, arg: any);</code>).</p>",
        "id": 533591685,
        "sender_full_name": "Nathan Bedell",
        "timestamp": 1754760593
    },
    {
        "content": "<p>it sounds like you're just running into the reentrancy problem. You are probably calling a guest function which in turn asks a host function for an asynchronous response, but your host function tries to respond immediately. In js I do setImmediate(() =&gt; { respond(id, data) }) so that the respond guest function is called the next frame instead of directly reentering</p>",
        "id": 533601853,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1754773851
    },
    {
        "content": "<p>wasm only has one stack. The guest has called your host function and the stack is alive at least until your host function returns. If your host function now wouold call another wasm function, then wasm would have to create a second stack that is independent from the first stack and that is not allowed</p>",
        "id": 533601952,
        "sender_full_name": "Ramon Klass",
        "timestamp": 1754773991
    },
    {
        "content": "<p>Hmm... Ok, I guess I'll play around with when the callbacks are invoked to see if I can get around that.</p>",
        "id": 533602351,
        "sender_full_name": "Nathan Bedell",
        "timestamp": 1754774558
    }
]