[
    {
        "content": "<p>The <a href=\"https://docs.wasmtime.dev/stability-tiers.html?highlight=custom-page#tier-3\">Tiers of Support</a> page of Wasmtime's documentation lists <code>riscv32imac-unknown-none-elf</code>as a tier 3 platform. However, trying to use that target with <code>config.target(\"riscv32imac-unknown-none-elf\")</code> errors with <code>\"Support for this target has not been implemented yet\"</code>.  Am I misunderstanding the support tiers ? Or was that support dropped at some point ?</p>",
        "id": 553815420,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1762338266
    },
    {
        "content": "<p>You have to use <code>config.target(\"pulley32\")</code> I think. Might also need to explicitly enable the pulley cargo feature.</p>",
        "id": 553846399,
        "sender_full_name": "bjorn3",
        "timestamp": 1762347131
    },
    {
        "content": "<p>Cranelift doesn't have a riscv32 backend, so you have to use the pulley backend instead which emits bytecode that wasmtime can run through an interpreter.</p>",
        "id": 553846580,
        "sender_full_name": "bjorn3",
        "timestamp": 1762347181
    },
    {
        "content": "<p>Ah then I misunderstood the documentation. Is there somewhere that breakdowns the architecture support between Cranelift/Winch/Pulley ?</p>",
        "id": 553849517,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1762348010
    },
    {
        "content": "<p>Also follow-up question, is it reasonable to expect that any 32/64 bit target reasonably supported by rustc would be supported by wasmtime through Pulley or do that require some specific work on Pulley itself ?</p>",
        "id": 553850131,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1762348186
    },
    {
        "content": "<p>Pulley should be able to support every target, but if you need the async feature, I believe wasmtime-fiber does still need architecture specific code. Winch only supports x86_64 and arm64. Cranelift supports x86_64, arm64, riscv64 and s390x (ibm system-z)</p>",
        "id": 553872676,
        "sender_full_name": "bjorn3",
        "timestamp": 1762353322
    },
    {
        "content": "<p>Compiler architecture support is <a href=\"https://docs.wasmtime.dev/stability-tiers.html?highlight=custom-page#compiler-support\">here</a>, and Pulley is listed separately because bjorn3 is right, Pulley should support any architecture that Rust can be compiled to</p>",
        "id": 553879016,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1762354732
    },
    {
        "content": "<p>Thanks for the responses, I must say that I'm not sure how useful it is to list architecture that are supported by default through Pulley. The current structure of the table made me think that <code>riscv32imac</code> was \"more supported\" than say <code>thumbv7em-none-eabihf</code> when this is not the case</p>",
        "id": 553885960,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1762356222
    },
    {
        "content": "<p>Our listing of tier 3 targets is more-or-less what we do in CI currently. We can't really just take every rust target that exists and list it in tier 3 in a sense... Do you think though it would help to have more words about missing targets? For example say that if a target is missing it doesn't mean that it's unsupported it just means that we're not building it in CI?</p>",
        "id": 553897161,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1762358447
    },
    {
        "content": "<p>I don't really know, I think that an idea could be to change the tier structure be by compilers so you have Tier1, 2 3 for Cranelift, Tier 1, 2, 3 for Winch and for Pulley instead of tiers you just say that as pure rust code, it's expected to work on every target supported by rustc but that the only targets tested in CI are X, Y, Z etc. (probably as a table)</p>",
        "id": 553902906,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1762359756
    },
    {
        "content": "<p>True yeah! I know I've found it pretty difficult to succinctly and accurately describe the various support for various features in Wasmtime over time...</p>",
        "id": 553929834,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1762366070
    }
]