[
    {
        "content": "<p>Currently I allow components to make host calls for stuff like registrations/logging/etc. I am wondering if there is some way for the host to know which component is making the call so that I can do things like mapping the registration to the correct component. Let me know if you would like to see some examples of what I mean if necessary.</p>",
        "id": 555365160,
        "sender_full_name": "Celarye",
        "timestamp": 1763042969
    },
    {
        "content": "<p>this came up in a conversation in our team just yesterday as well.</p>\n<p>One question: do you need to know which component <em>type</em> the call came from, or which component <em>instance</em>? In our case the latter is important, as the same component type could be instantiated multiple times, and with different sets of configuration</p>",
        "id": 555378418,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1763045768
    },
    {
        "content": "<p>Yes it's indeed the instance I want to be able to differentiate on. If I understand it correctly they're all the same type anyways (instantiate them with <code>Plugin::instantiate_async</code>, where Plugin is a wit-bindgen generated type).</p>",
        "id": 555380635,
        "sender_full_name": "Celarye",
        "timestamp": 1763046239
    },
    {
        "content": "<p>the type would still be different per specific component, even if the implemented interfaces are the same. The difference is mostly relevant for component graphs, where a nested component could make a call instead of the top-level one, I guess</p>",
        "id": 555453271,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1763066195
    },
    {
        "content": "<p>We have been working on some changes to Wasmtime to allow this that were briefly discussed <a href=\"#narrow/channel/217126-wasmtime/topic/New.20functionality.20useful.20for.20attestation/with/553956315\">here</a> earlier this month.  But this is still at the \"interesting [to me] academic project\" stage rather than something that might be upstreamed as-is.  I wasn't able to see a good way of doing it with stock Wasmtime unfortunately.</p>",
        "id": 558000999,
        "sender_full_name": "Lachlan Gunn",
        "timestamp": 1763487061
    },
    {
        "content": "<p>It seems that this topic and a relevant PR by Lachlan Gunn and their team has gone stale. And unfortunately looking at the discussions in that PR I think I'm quite a bit in over my head here.</p>\n<p>But I think supporting some way to identifying the component making a host still will be very useful. And as Till Schneidereit's team also seemed to have some interest in this feature I wanted to poll if there has been any progress towards supporting this?</p>\n<p>If not I would love to eventually try and put work into contributing a feature like this myself but this would of course require quite some time and guidance for me to learn how Wasmtime's internals and so work.</p>",
        "id": 571080603,
        "sender_full_name": "Eduard Smet (Celarye)",
        "timestamp": 1769792488
    },
    {
        "content": "<blockquote>\n<p>component making a host</p>\n</blockquote>\n<p>I meant \"making a host call\" but sadly can't edit the above message anymore.</p>",
        "id": 571089626,
        "sender_full_name": "Eduard Smet (Celarye)",
        "timestamp": 1769795054
    },
    {
        "content": "<p>My understanding of the conclusions of discussions around this is that ideally wasmtime would not provide caller information to host functions. That is unlikely to ever happen on the web, for example, and has a lot of downsides in terms of long term maintainability and design.</p>\n<p>Put another way, ideally the need for this feature would be resolved a different way. If you're up for it we can chat over a new zulip topic perhaps focused on your use case</p>",
        "id": 571094947,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1769796679
    },
    {
        "content": "<p>I see, I will make a new post!</p>",
        "id": 571096072,
        "sender_full_name": "Eduard Smet (Celarye)",
        "timestamp": 1769797119
    }
]