[
    {
        "content": "<p>Hi there, </p>\n<p>I'm working on a \"WASI-native\" programming language with pervasive suspension (and structured concurrency with cleanup guarantees to make that not a nightmare), targeting bleeding edge draft specs for various Wasm proposals. I based my concurrency story on the stack switching proposal, and then realised it's currently only implemented for <code>x86_64</code>.</p>\n<p>Is an implementation for <code>aarch64</code> or Pulley on anyone's radar? I'm just trying to decide whether to write my own hacks or wait until I can try stack switching on my own machine.</p>\n<p>Thanks! <span aria-label=\"sparkling heart\" class=\"emoji emoji-1f496\" role=\"img\" title=\"sparkling heart\">:sparkling_heart:</span></p>",
        "id": 568932044,
        "sender_full_name": "Jeff Parsons",
        "timestamp": 1768876834
    },
    {
        "content": "<p>radar, absolutely.</p>",
        "id": 568972416,
        "sender_full_name": "Ralph",
        "timestamp": 1768900165
    },
    {
        "content": "<p>Maybe I should ask \"is anyone funded to work on it within the next few quarters, or expecting to be?\"</p>",
        "id": 568977047,
        "sender_full_name": "Jeff Parsons",
        "timestamp": 1768901607
    },
    {
        "content": "<p>at least from my point of view, unfortunately no (too many other priorities). IIRC, stack switching on x86-64 still needs a bit more work (there's at least one missing opcode, <code>resume_throw</code>) too. If you or anyone else has the ability to put work into it, that'd be much appreciated!</p>",
        "id": 569076592,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1768927050
    },
    {
        "content": "<p>Thank you, that is very helpful information.</p>\n<p>Re me getting involved, I'll take a look but I suspect it'll be a lot more than I can manage at the moment. (My discretionary \"programming\" currently looks like ideation on the train on days I'm working then handing off to Claude between getting the kids to sleep and passing out myself. I don't think you want that sort of code in Cranelift or Wasmtime... <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>)</p>",
        "id": 569152314,
        "sender_full_name": "Jeff Parsons",
        "timestamp": 1768956676
    },
    {
        "content": "<p>While I did a spike on stack switching last year, it isn't currently at the top of my priorities at the moment either.  I do hope to, in the relative near term, land some final bits that never to add additional test coverage that never landed with the original set of patches but otherwise don't think it will be a focus area for me in the next several months.</p>",
        "id": 570672660,
        "sender_full_name": "Paul Osborne",
        "timestamp": 1769639568
    }
]