[
    {
        "content": "<p>Hi, I was trying to run wasmtime with async on an ESP32-C6 which has a 32 bits RISCV architecture. This failed because the stack switching from wasmtime-fiber is not implemented for <code>riscv32</code>. It is however for <code>riscv64</code> so my question is two fold : </p>\n<ul>\n<li>Is there plans to implement this for <code>riscv32</code>?</li>\n<li>and if so, is it something that's easy to do considering that the <code>riscv64</code> logic exists ?</li>\n</ul>",
        "id": 546429327,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1761131794
    },
    {
        "content": "<p>To support Wasmtime on riscv32 you also need Cranelift support for this, which like any new architecture is non-trivial to add. There are currently no plans to add it that I'm aware of. External contributions may be accepted, but please check with one of the Cranelift maintainers to be sure. Also see <a class=\"message-link\" href=\"/#narrow/channel/217117-cranelift/topic/Creating.20a.20new.20instruction.20set.20for.20a.20toy.20architecture/near/529913643\">#cranelift &gt; Creating a new instruction set for a toy architecture @ 💬</a></p>",
        "id": 546442860,
        "sender_full_name": "bjorn3",
        "timestamp": 1761135485
    },
    {
        "content": "<p>Isn't cranelift support kind of orthogonal ? I am using wasmtime with success on platforms not directly supported by cranelift, 32 bit ARM Cortex M (ARMv6-M and ARMv7-M),  through the pullley32 \"target\"</p>",
        "id": 546444293,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1761135883
    },
    {
        "content": "<p>Right. Doesn't look like it would be too hard to port wasmtime-fiber.</p>",
        "id": 546444795,
        "sender_full_name": "bjorn3",
        "timestamp": 1761136037
    },
    {
        "content": "<p>And for the record, wasmtime does work on RISCV 32 bits, the stack switching from <code>wasmtime-fiber</code>doesn't (and hence the <code>async</code> feature from <code>wasmtime</code>)</p>",
        "id": 546444880,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1761136063
    },
    {
        "content": "<p>Current maintainers aren't experts/maintainers of riscv32, so we rely on contributions for support like this. It in theory wouldn't be too hard to add such support for someone knowledgable about riscv32 assembly, and PRs are always welcome!</p>",
        "id": 546475533,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1761143859
    },
    {
        "content": "<p>Hello, we're interested in getting stack switching working on 32-bit RISC-V to support using async in wasmtime, too. This is the only conversation regarding this which we could find. Has there been any progress on this since the posts here?</p>",
        "id": 569013551,
        "sender_full_name": "Max D.",
        "timestamp": 1768912708
    },
    {
        "content": "<p>Not that I'm aware of</p>",
        "id": 569035222,
        "sender_full_name": "Antoine Lavandier",
        "timestamp": 1768918077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1015286\">@Max D.</span> No one has contributed such support; contributions are still welcome if you're interested in working on this</p>",
        "id": 569076036,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1768926903
    },
    {
        "content": "<p>Thanks a lot for the answers! We are going to work on an implementation to contribute.</p>",
        "id": 569291758,
        "sender_full_name": "Max D.",
        "timestamp": 1769011117
    }
]