[
    {
        "content": "<p>What's the current thinking around when support for WASI preview 1 will be discontinued in wasmtime-wasi? I'm having trouble locating anything explicitly documented online.</p>",
        "id": 555216411,
        "sender_full_name": "Jeff Charles",
        "timestamp": 1762979237
    },
    {
        "content": "<p>We've got no plans for removal at this time</p>",
        "id": 555223926,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1762982007
    },
    {
        "content": "<p>Given it's a preview API, how long can we safely assume it will continue to be supported by wasmtime-wasi for? Or maybe phrased differently, if support were to be discontinued, how much advance notice would we have?</p>",
        "id": 555225329,
        "sender_full_name": "Jeff Charles",
        "timestamp": 1762982570
    },
    {
        "content": "<p>We don't necessarily have a formal framework around this so I don't think I can give a definitive answer for that. My gut though is that you would have plenty of notice. Everyone's more-or-less in the same boat of needing to support it, and if someone ends up being the only one in the boat of needing to support it as everyone else has moved on there's probably a migration path out of the boat which everyone else took in a sense.</p>\n<p>Which isn't really saying much I realize, but we basically haven't created a formal policy by which it can be removed and decided advance notice and such</p>",
        "id": 555226383,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1762983005
    },
    {
        "content": "<p>To add a bit from my perspective: the \"preview\" in \"preview 1\" is literally in the name, but de facto it wasn't exactly a short-lived preview; everyone recognizes the significant weight it's carrying; I don't think Wasmtime as a project would try to use the \"preview\" wording in a \"well technically...\" kind of move and deprecate things quickly</p>",
        "id": 555227011,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1762983244
    },
    {
        "content": "<p>That said it should be our sincere hope that no one deploys <em>new</em> use-cases today using p1. In the embedding I work on, which hasn't shipped yet, we'll be components-first/only</p>",
        "id": 555227202,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1762983320
    },
    {
        "content": "<p>In my case, it's not new use cases, just legacy ones. But with WASI 1.0 on the horizon, it seems prudent to check my expectations around ongoing support for preview 1 after 1.0 is released.</p>",
        "id": 555227565,
        "sender_full_name": "Jeff Charles",
        "timestamp": 1762983488
    },
    {
        "content": "<p>I don't forsee us dropping wasip1 when 1.0 is released. Perhaps a year-or-so down the road, but we understand that shifting from wasip1 to 1.0 is going to take time for some embeddings</p>",
        "id": 555228094,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1762983688
    },
    {
        "content": "<p>I understand this isn't a formal guarantee, but you're thinking mid-2027 then?</p>",
        "id": 555228243,
        "sender_full_name": "Jeff Charles",
        "timestamp": 1762983756
    },
    {
        "content": "<p>I would be surprised if we deleted wasip1 less than a year after wasi 1.0 is released</p>",
        "id": 555228693,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1762983947
    },
    {
        "content": "<p>and wasi 1.0 is still in-the-works</p>",
        "id": 555228710,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1762983952
    },
    {
        "content": "<p>fwiw, when we created the wasipN naming scheme we deliberately didn't mean for the \"p\" to expand to \"preview\". Instead, it's really just \"p\", or, if you must, \"point\".</p>\n<p>I say this because as others have said, we have no plans at all to abandon support for it in any foreseeable future. And even once WASI 1.0 is released, I would fully assume that we'll continue supporting p1-3 for years to come in Wasmtime</p>",
        "id": 555379691,
        "sender_full_name": "Till Schneidereit",
        "timestamp": 1763046029
    }
]