[
    {
        "content": "<p>Hey,</p>\n<p>This is my first attempt to be part of an open-source project, and I feel kind of hesitated. :) I wanted to understand and contribute to Cranelift. Should I dive into an issue from GitHub for understanding by practise, or am I should just start to read the source code?</p>\n<p>Sorry if the question seems a bit vague. :)</p>",
        "id": 565891804,
        "sender_full_name": "Tarbetu",
        "timestamp": 1767183274
    },
    {
        "content": "<p>Both are good approaches. It's hard to say more without knowing your experience and your goals. Do you want to understand compilers in general? Do you want to work on one? How well do you know Rust? How well do you know compilers? Are you wanting to use Cranelift somewhere or work on Cranelift itself? Etc.</p>\n<p>If you understand compilers and want to work on one, we do have a bunch of open issues and we could try to point at a few (in theory we have a \"good first issue\" tag but it's not always up-to-date). If you want to learn, reading the source is never a bad idea!</p>",
        "id": 565922705,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1767206039
    },
    {
        "content": "<p>Hey! Thank you for your response.</p>\n<p>I'm trying to educate myself on compilers, but I'm only jumping around the concepts of compiler frontend. I think contributing to Cranelift could educate myself on the compiler backend. I know LLVM, I can generate LLVM bytecode, I understand LLVM IR, and I am aware about the concepts like SSA, but I believe Cranelift is better to understanding how the code generation work. So, I want to understand the internals in the first place.</p>\n<p>Another reason that I focused on Cranelift instead of LLVM is the Rust. I can code and understand C++ code, but I believe Rust is much more readable, and I feel more comfortable when coding with Rust. That said, I'm trying to design and implement a programming language in Rust and I think implementing the codegen with Cranelift might be interesting than LLVM.</p>",
        "id": 565969240,
        "sender_full_name": "Tarbetu",
        "timestamp": 1767264562
    },
    {
        "content": "<p>That sounds good -- I would say (i) using Cranelift as your backend from your programming language, and (ii) reading Cranelift source code when you're curious how it works, would be a good way to understand the whole pipeline!</p>",
        "id": 566074950,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1767370499
    },
    {
        "content": "<p>So, based on your advise I use Cranelift and check the code under the hood. It's a great idea. Thanks!</p>",
        "id": 566088210,
        "sender_full_name": "Tarbetu",
        "timestamp": 1767378444
    }
]