[
    {
        "content": "<p>Hello! I've looked at <a href=\"https://github.com/bytecodealliance/wasmtime/issues/10427\">#10427</a> and it made me interested. I'd like to experiment with it. A first step might be evaluating performance impact of adding an <code>Effect</code> value type and plugging it through all instructions that have side-effects, without using it for optimization. However, I'm not sure if this would be worth it by itself. <br>\nThe second step might be reworking elaboration to use effect lists instead of side-effecting skeleton (I'm sure, that this idea has been mentioned in some cranelift issue discussion, but I can't find it right now) and adding a couple of simple trap rewrites. For now I don't know how to implement the existing load/store optimizations with this approach, something has to be figured out.<br>\nWhat do you think? Is it worthwhile to pursue this avenue?</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/issues/10427\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/277e3b15fa18b9dab7b6ca97b6915257f4ded35b/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f363235643831626637353734323332393230346363313835383638333366373739363864623661643563373036323031313036343138666561646263373032632f62797465636f6465616c6c69616e63652f7761736d74696d652f6973737565732f3130343237&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/issues/10427\" title=\"Cranelift: towards representing control and effect dependencies in CLIF 路 Issue #10427 路 bytecodealliance/wasmtime\">Cranelift: towards representing control and effect dependencies in CLIF 路 Issue #10427 路 bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">Note: pie-in-the-sky ideas incoming. I'm not proposing we stop everything and do this immediately, just that we consider it for Cranelift's long-term evolution. Apologies if anything here isn't sup...</div></div></div>",
        "id": 509018212,
        "sender_full_name": "amartosch",
        "timestamp": 1743335215
    },
    {
        "content": "<p>I'm happy to see excitement for this! At the same time, I might inject a little bit of caution here: removing the side-effecting skeleton completely and scheduling according to only control-dep edges is a large step, and one that would require basically a research-problem-level consideration of how to integrate the new approach with the aegraphs framework. That's a lot of work to undertake upfront for uncertain payoff.</p>\n<p>(Note also that Nick's writeup, and subsequent discussion re: recent sea-of-nodes discourse, note that we probably <em>don't</em> want to fully schedule from scratch; and that's what removing the skeleton would have us do. It seems more worthwhile to think about ways to deviate from the skeleton when we see that deps allow us to do so...)</p>\n<p>It might be good to quantify opportunity first: encode control deps, then find examples in the wild where we know that the deps should let us reorder ops that we otherwise cannot. Once we have those, we know it's worthwhile, and we can experiment with the above with particular examples to drive us.</p>",
        "id": 509094573,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1743392000
    }
]