[
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2505.22610\">TPDE: A Fast Adaptable Compiler Back-End Framework</a> was recently published.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://arxiv.org/abs/2505.22610\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/77b496a8318ec05f451552798bd4d765e6483abb/68747470733a2f2f61727869762e6f72672f7374617469632f62726f7773652f302e332e342f696d616765732f61727869762d6c6f676f2d66622e706e67&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://arxiv.org/abs/2505.22610\" title=\"TPDE: A Fast Adaptable Compiler Back-End Framework\">TPDE: A Fast Adaptable Compiler Back-End Framework</a></div><div class=\"message_embed_description\">Fast machine code generation is especially important for fast start-up just-in-time compilation, where the compilation time is part of the end-to-end latency. However, widely used compiler frameworks like LLVM do not prioritize fast compilation and require an extra IR translation step increasing latency even further; and rolling a custom code generator is a substantial engineering effort, especially when targeting multiple architectures.\n  Therefore, in this paper, we present TPDE, a compiler back-end framework that adapts to existing code representations in SSA form. Using an IR-specific adapter providing canonical access to IR data structures and a specification of the IR semantics, the framework performs one analysis pass and then performs the compilation in just a single pass, combining instruction selection, register allocation, and instruction encoding. The generated target instructions are primarily derived code written in high-level language through LLVM's Machine IR, easing portability to different architectures while enabling optimizations during code generation.\n  To show the generality of our framework, we build a new back-end for LLVM from scratch targeting x86-64 and AArch64. Performance results on SPECint 2017 show that we can compile LLVM-IR 8--24x faster than LLVM -O0 while being on-par in terms of run-time performance. We also demonstrate the benefits of adapting to domain-specific IRs in JIT contexts, particularly WebAssembly and database query compilation, where avoiding the extra IR translation further reduces compilation latency.</div></div></div>",
        "id": 522885457,
        "sender_full_name": "Olivier FAURE",
        "timestamp": 1749289749
    },
    {
        "content": "<blockquote>\n<p>6.2.1 Setup. We evaluate the performance of the Cranelift back-end by measuring compile- and run-time on the three default benchmarks in Wasmtime’s own benchmark suite Sightglass [10] and PolyBench [31 ]. We compare this against Cranelift with its backtracking and single pass register allocator, both without any IR optimizations, and Winch. [...]<br>\n6.2.2 Results. Figure 9 shows the results. <strong>The TPDE-based back-end compiles 4.27x faster than Cranelift and 2.68x faster than Cranelift with its fast register allocator</strong>, but is 1.74x slower than Winch. [...] The run-time performance of TPDE-generated code is faster than both Winch and Cranelift with its fast register allocator (1.14x and 1.31x respectively), but 1.64x slower than Cranelift with its default backtracking register allocator. This shows that a more sophisticated register allocation heuristic is likely to substantially improve the run-time performance.</p>\n</blockquote>",
        "id": 522885576,
        "sender_full_name": "Olivier FAURE",
        "timestamp": 1749289895
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"354194\">@Olivier FAURE</span> yes, those numbers are interesting; my main takeaway was that good regalloc is important (1.64x faster code from Cranelift over TPDE) :-) TDPE and Cranelift serve different design points -- both are useful. The more interesting part of the project is the general IR consumer interface -- that's pretty neat</p>",
        "id": 523316430,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1749568635
    },
    {
        "content": "<p>Did you have specific questions or thoughts?</p>",
        "id": 523316470,
        "sender_full_name": "Chris Fallin",
        "timestamp": 1749568651
    }
]