[
    {
        "content": "<p>The README seems heavily outdated.</p>\n<p>It says at the beginning, that the repo developes C#, C, Java, TinyGo and Rust.</p>\n<p>Thats not correct at multiple levels, given that Java is not supported anymore, C++ is supported as well, and I think the community implementations of Javascript and Python deserve to be mentioned as well.</p>\n<p>Plus, there seems to be some support for Moonbit, and half of all that information is contained somewhere later down the README, and not at the top.</p>\n<p>I send a PR regarding the order of some of that initial paragraph, but it seems I need to check out first, whats the real support status on all languages.</p>",
        "id": 527175154,
        "sender_full_name": "ShalokShalom",
        "timestamp": 1751633462
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"926999\">@ShalokShalom</span> thanks for taking on the work to improve the README for <code>wit-bindgen</code> -- I think what you posted here would have gone really well in a Github issue (that you could close with the PR you're about to create).</p>\n<p>Looking forward to your proposed update!</p>",
        "id": 527380302,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1751844786
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"598440\">Victor Adossi</span> <a href=\"#narrow/channel/327223-wit-bindgen/topic/documentation.20README/near/527380302\">said</a>:</p>\n<blockquote>\n<p>Hey <span class=\"user-mention silent\" data-user-id=\"926999\">ShalokShalom</span> thanks for taking on the work to improve the README for <code>wit-bindgen</code> -- I think what you posted here would have gone really well in a Github issue (that you could close with the PR you're about to create).</p>\n<p>Looking forward to your proposed update!</p>\n</blockquote>\n<p>Thanks. I am questioning, if my recollection of the new stuff is complete?</p>",
        "id": 527818025,
        "sender_full_name": "ShalokShalom",
        "timestamp": 1752043609
    },
    {
        "content": "<p>I think it's certainly a good start -- others will be able to chime in on the PR and help shape up your updates!</p>\n<p>At this point, the best \"source of truth\" is the code (as you've found!) and having an update to get the README more in line with what is implemented would be a great contribution</p>",
        "id": 527867708,
        "sender_full_name": "Victor Adossi",
        "timestamp": 1752060829
    }
]