[
    {
        "content": "<p>Hi, all. I am wondering what the best way to store state in the <code>Guest</code> struct is when implementing the <code>Guest</code> trait after <code>wit_bindgen::generate</code>.</p>\n<p>Ideally I would be able to define fields in the struct for which I am defining the <code>impl</code>. However, there is no <code>self</code> paramter. All the functions are associated functions. Is the only option to store state in global variables?</p>\n<p>Thank you.</p>",
        "id": 532374756,
        "sender_full_name": "Jonathan H",
        "timestamp": 1754080324
    },
    {
        "content": "<p>Yes you'll have to use global state because these are global functions</p>",
        "id": 532376296,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1754081068
    },
    {
        "content": "<p>Do you happen to have any examples for a good convention for that? Or is it just something like <code>OnceCell</code> with a mutex?</p>",
        "id": 532382993,
        "sender_full_name": "Jonathan H",
        "timestamp": 1754084641
    },
    {
        "content": "<p>Hey all. Random question: I'm curious what the general performance characteristics are of passing resource types between components. Can it be expected to be fairly fast?</p>\n<p>I'm just wondering because I'm used to the JNI, where doing similar things is generally considered to be fairly slow. Is the situation better for WASM?</p>\n<p>The larger motivation behind this is I'm trying to figure out the most efficient way to design a wit world for multi-platform UI development. Currently in my prototype I have a resource type for views basically, but I'm wondering if that's the right approach, or if I should try something else (e.x. passing a single representation of the entire UI layout in a single call by value -- so using something like a DOM represented with variants / records basically).</p>\n<p>I know I won't get a more concrete answer until I bench this myself, but I'm curious if anyone had any general thoughts.</p>",
        "id": 532460765,
        "sender_full_name": "Nathan Bedell",
        "timestamp": 1754146106
    },
    {
        "content": "<p>Oof, sorry. New to zulip. I think I should have made a new topic for this. :(</p>",
        "id": 532461964,
        "sender_full_name": "Nathan Bedell",
        "timestamp": 1754146944
    },
    {
        "content": "<p>I had the same question and if I understand it correctly we should be able to use <a href=\"https://component-model.bytecodealliance.org/design/wit.html#resources\">resources</a> for this. The Rust example in this book has a <a href=\"https://component-model.bytecodealliance.org/language-support/rust.html#using-them\">section on implementing resources</a>.</p>",
        "id": 532465823,
        "sender_full_name": "Celarye",
        "timestamp": 1754149791
    },
    {
        "content": "<p>I broke the second link, it should be <a href=\"https://component-model.bytecodealliance.org/language-support/rust.html#using-resources\">https://component-model.bytecodealliance.org/language-support/rust.html#using-resources</a>.</p>",
        "id": 532466765,
        "sender_full_name": "Celarye",
        "timestamp": 1754150482
    },
    {
        "content": "<p>Nevermind, global variables are probably better for this <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 532479287,
        "sender_full_name": "Celarye",
        "timestamp": 1754160826
    }
]