[
    {
        "content": "<p>Thank you, that is what I thought. </p>\n<p>I was aware of the WAC tool, but it's documentation jumps from simple examples to quite complex formal specification.</p>\n<p>I wasn't sure that I might not have overlooked some details which might have made it possible.</p>",
        "id": 523238882,
        "sender_full_name": "Jan Vanhoof",
        "timestamp": 1749545382
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"912188\">Jan Vanhoof</span> has marked this topic as resolved.</p>",
        "id": 523238952,
        "sender_full_name": "Notification Bot",
        "timestamp": 1749545397
    },
    {
        "content": "<p>I did some further tests and I think I've got my answers.</p>\n<p>I'll leave my findings in case someone else stumbles upon it.</p>\n<ul>\n<li>What was not clear for me from the WAC documentation (although it is actually mentioned now I know) is that all the imports of the components that are not fulfilled by an export will be merged as an import for the resulting composition.</li>\n<li>An export can be linked to multiple imports, but not the other way around. Not sure what I did wrong last time in <a href=\"http://wasmbuilder.app\">wasmbuilder.app</a>, but now it worked.</li>\n<li>You can import and reexport the same interface, however, in my example it wouldn't have worked, as <code>component A</code> already imports the <code>run</code> function exported by <code>component B</code>. If <code>component B</code> would import something from <code>component A</code> that would result in a cyclic graph, which is not allowed.</li>\n</ul>",
        "id": 525052349,
        "sender_full_name": "Jan Vanhoof",
        "timestamp": 1750429459
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"912188\">Jan Vanhoof</span> has marked this topic as resolved.</p>",
        "id": 525052362,
        "sender_full_name": "Notification Bot",
        "timestamp": 1750429466
    }
]