[
    {
        "content": "<p>Good day!  Question, can one use a freshly-built wasi-sdk from its local build/install dir, without merging the sysroot and toolchain?  I try running <code>WASI_SDK_PATH=~/src/wasip3/wasi-sdk/build/install cc --sysroot=$WASI_SDK_PATH/share/wasi-sysroot -resource-dir $WASI_SDK_PATH</code> but there is always some kind of path problem.  Any tips are welcome <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 534253699,
        "sender_full_name": "Andy Wingo",
        "timestamp": 1755098482
    },
    {
        "content": "<p>I haven't build the latest version of wasi-sdk, but earlier versions put an <code>opt/wasi-sdk</code> directory under <code>build/install</code>, in which case you'd use e.g. <code>WASI_SDK_PATH=~/src/wasip3/wasi-sdk/build/install/opt/wasi-sdk</code>.  What do you see under the <code>build/install</code> directory?</p>",
        "id": 534255561,
        "sender_full_name": "Joel Dice",
        "timestamp": 1755099102
    },
    {
        "content": "<p>(That may have changed since Alex switched from <code>make</code> to <code>cmake</code> for building.  I'm building the <code>main</code> branch locally now to see what's different.)</p>",
        "id": 534256403,
        "sender_full_name": "Joel Dice",
        "timestamp": 1755099379
    },
    {
        "content": "<p>Ok, looks like the <code>cmake</code>-based build uses a different directory structure, with the toolchain and sysroot using separate build steps and directories.  I think you'll need to follow all the instructions in the <code>Build</code> section of the <code>README.md</code> -- up to and including the <code>./ci/merge-artifacts.sh</code>step  -- and then untar the resulting tarball and use that.  <span class=\"user-mention\" data-user-id=\"253994\">@Alex Crichton</span> might know if there are any shortcuts.</p>",
        "id": 534261255,
        "sender_full_name": "Joel Dice",
        "timestamp": 1755101031
    },
    {
        "content": "<p>I think what you'll want to do is specify <code>-DCMAKE_INSTALL_PREFIX=...</code> and use <code>make install</code> (or the equivalent) to produce a working toolchain -- the installation step can be anywhere on your system but otherwise it'll be a bit painful as you've seen trying to use the artifacts from where they reside in the build directory</p>",
        "id": 534275163,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1755106734
    },
    {
        "content": "<p>I'll admit though I haven't tested this and I'm probably forgetting something</p>",
        "id": 534275250,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1755106773
    },
    {
        "content": "<p>Ok sort of paging this back in, I think if you install the toolchain/sysroot to the same location that's the \"merge\" operation. Would that work well enough for what you're doing? (I realize running the <code>./ci/merge-*</code> script is funky, but the \"install both\" is in theory a simpler merge)</p>",
        "id": 534275425,
        "sender_full_name": "Alex Crichton",
        "timestamp": 1755106866
    }
]