[
    {
        "content": "<p>I've started implementing my own handling for compressing and decompressing HTTP response bodies to abstract away those details from component plugin authors (who'll either operate on decoded byte streams or collect all the bytes themselves) -- I was curious whether there are any plans to implement anything like this in <code>wasi-http</code>?</p>\n<p>In particular it seems like if I have a series of components which will potentially read/modify the same body that it would be useful for the host to manage any encoding/decoding to prevent duplicated work across invocations (and lead to less code for guests to write) -- though I'm sure there are things I don't yet understand about <code>wasmtime</code> that might make this not the case <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 562785441,
        "sender_full_name": "Theodore Brockman",
        "timestamp": 1765310159
    },
    {
        "content": "<p>One of the first demos I wrote for the component model async feature was <a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/crates/test-programs/src/bin/p3_http_middleware.rs\">request/response (de)compression middleware</a> which can be composed transparently with an arbitrary <code>wasi:http@0.3.0-draft</code> handler component written in any language.</p>\n<div class=\"message_embed\"><a class=\"message_embed_image\" href=\"https://github.com/bytecodealliance/wasmtime/blob/main/crates/test-programs/src/bin/p3_http_middleware.rs\" style=\"background-image: url(&quot;https://uploads.zulipusercontent.net/8bd4d2be6b1e32c11c875da11b39600ecb57dcc2/68747470733a2f2f6f70656e67726170682e6769746875626173736574732e636f6d2f356230323761646535346564623137623838336262343361313964366538323635623731643866303562656136636632396461363532383430343363666536652f62797465636f6465616c6c69616e63652f7761736d74696d65&quot;)\"></a><div class=\"data-container\"><div class=\"message_embed_title\"><a href=\"https://github.com/bytecodealliance/wasmtime/blob/main/crates/test-programs/src/bin/p3_http_middleware.rs\" title=\"wasmtime/crates/test-programs/src/bin/p3_http_middleware.rs at main · bytecodealliance/wasmtime\">wasmtime/crates/test-programs/src/bin/p3_http_middleware.rs at main · bytecodealliance/wasmtime</a></div><div class=\"message_embed_description\">A lightweight WebAssembly runtime that is fast, secure, and standards-compliant - bytecodealliance/wasmtime</div></div></div>",
        "id": 562794110,
        "sender_full_name": "Joel Dice",
        "timestamp": 1765312827
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"509936\">@Joel Dice</span>  Yes! I do recall finding this at some point (and it's a very helpful example, thank you!), I suppose I was imagining a host implementation which does so lazily (only at the point <code>body</code> is actually consumed) -- should I take this to mean that the intention is primarily to leave this sort of thing to component composition?</p>",
        "id": 562797467,
        "sender_full_name": "Theodore Brockman",
        "timestamp": 1765313955
    },
    {
        "content": "<p>I believe the middleware example above is \"lazy\" in that sense. Speaking for myself I think its great when component composition can address functionality like this, and unless you need the absolutely highest possible performance I think its a good place to start.</p>",
        "id": 562798584,
        "sender_full_name": "Lann Martin",
        "timestamp": 1765314316
    },
    {
        "content": "<p>If we're talking about e.g. <code>wasmtime serve</code>, then yes, I expect this would be the kind of thing we'd leave to composition.  If we're talking about a custom host embedding of Wasmtime, the author of such an embedding is of course free to add as many or as few features as they choose.</p>\n<p>In general, adding features like this via composition will be more portable than a a host feature.</p>\n<p>And yes, as Lann pointed out, the above middleware <em>is</em> lazy unless I'm misunderstanding what you mean by that term.</p>",
        "id": 562798799,
        "sender_full_name": "Joel Dice",
        "timestamp": 1765314390
    }
]